{
  "General": [
    {
      "Type": "Table",
      "Name": "Default Advancement",
      "Advancement": [
        [
          "Ancestry Feat",
          "Background",
          "Initial Proficiencies"
        ],
        [
          "Skill Feat"
        ],
        [
          "General Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "Ancestry Feat",
          "Ability Boosts",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "General Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "Ancestry Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat",
          "Ability Boosts"
        ],
        [
          "General Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "Ancestry Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "General Feat",
          "Ability Boosts",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "Ancestry Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat"
        ],
        [
          "General Feat",
          "Skill Increase"
        ],
        [
          "Skill Feat",
          "Ability Boosts"
        ]
      ]
    },
    {
      "Proficiencies": [
        {
          "Name": "Unarmored",
          "Type": "Armor",
          "Value": "Trained"
        }
      ]
    }
  ],
  "Ancestries": [
    {
      "Type": "Ancestry",
      "Name": "Dwarf",
      "Info": [
        {
          "Description": "Dwarven lore tells epic tales of the short, stocky people’s long-ago pilgrimage from their Darklands home to the surface—a journey they undertook at the behest of a prophet of the god of dwarvenkind. The people reached their destination and built magnificent fortifications they came to call Sky Citadels, and many dwarves remain ensconced within these and other ancestral homes to this day. Given the dwarves’ harrowing history, their reputation as a stoic and stern people is well earned.",
          "Overview": "The dwarves’ ancient surface empire fell long ago, overwhelmed by orc and goblinoid enemies, but dwarves today retain many of the qualities that propelled their people to greatness in ancient times: fierceness, gumption, and stubbornness in endeavors ranging from battle and craftsmanship to forging ties with family and friends. Dwarves are slow to trust people who are not their kin—a tendency that traces to their history of bloody conflict with foes such as giants, orcs, and the horrors of the deeps. Trust from a dwarf is hard won, but as strong as iron.\n  These sturdy people stand about a foot shorter than most humans. Long hair is often a source of pride among them, particularly when braided into intricate patterns. Men are typically broader than women, and many men take pride in their long beards. Dwarves typically reach physical adulthood around the age of 25 and can live to around 350 years old. \n  The distance between dwarven mountain citadels creates vast cultural divides, but many dwarves share a common passion for architecture, gem cutting, metalwork, mining, and stonework. Dwarves revere honor, justice, and the traditions of their clans and kingdoms. Few dwarves are seen without a clan dagger, a weapon forged just before an individual dwarf’s birth and bearing the gemstone of the clan. Torag, the god of dwarvenkind, is a favored dwarven deity.",
          "HP": 10,
          "Size": "Medium",
          "Speed": 20,
          "Ability Boosts": [
            "Constitution",
            "Wisdom",
            "Free"
          ],
          "Ability Flaw": [
            "Charisma"
          ],
          "Languages": [
            "Common",
            "Dwarf"
          ],
          "Bonus Languages": [
            "Giant",
            "Gnome",
            "Goblin",
            "Orc",
            "Terran",
            "Undercommon"
          ],
          "Traits": [
            "Dwarf",
            "Humanoid"
          ],
          "Abilities": [
            "Darkvision",
            "Unburdened"
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 24
            }
          ]
        }
      ]
    },
    {
      "Type": "Ancestry",
      "Name": "Elf",
      "Info": [
        {
          "Description": "Elven culture is deep, rich, and on the decline. Their society peaked millennia ago, long before they fled Golarion to escape the calamity of Earthfall. Returning to a changed land, the elves have struggled to reclaim their ancestral homes, most notably from the terrible demons that have invaded parts of their homeland. Remnants of great elven settlements lie scattered across the Inner Sea region, and even their ancestral lands contain long-forgotten ruins and artifacts alongside newer structures.",
          "Overview": "Elves combine an otherworldly grace, sharp intellect, and mysterious charm in a way that is practically magnetic to members of other ancestries. They are often voraciously intellectual, though they fill their long years with complicated pedagogies that most shorter-lived peoples find inefficient. Elves also hold notoriously long grudges against their rivals, but these antagonistic relationships can sometimes blossom into friendship over time.\n  Elves are generally taller than humans, and they have a fragile grace accentuated with long facial features and sharply pointed ears. Broad pupils fill their wide eyes, giving elves an alien look and allowing them to see sharply even in very little light. Elves typically reach physical adulthood around the age of 20 (though they’re considered by other elves to be fully emotionally mature at close to the end of their first century), and they can live to around 600 years old.\n  Elves subtly and deeply attune to their environment and their companions, and they often take on physical traits reflecting their surroundings. An elf who has dwelled in primeval forests for centuries, for example, might exhibit verdant hair and gnarled fingers, while one who’s lived in a desert might have golden pupils and skin.\n  Elves are often emotional and capricious, yet they also value kindness and beauty. They prefer deities who share their love of all things mystic and artistic— Desna and Shelyn are particular favorites. Calistria is the most notorious of elven deities, as she represents many of the elven ideals taken to the extreme.",
          "HP": 6,
          "Size": "Medium",
          "Speed": 30,
          "Ability Boosts": [
            "Dexterity",
            "Intelligence",
            "Free"
          ],
          "Ability Flaw": [
            "Consititution"
          ],
          "Languages": [
            "Common",
            "Elven"
          ],
          "Bonus Languages": [
            "Celestial",
            "Draconic",
            "Gnoll",
            "Gnomish",
            "Goblin",
            "Orcish",
            "Sylvan"
          ],
          "Traits": [
            "Elf",
            "Humanoid"
          ],
          "Abilities": [
            "Low-Light Vision"
          ],
          "Reference": [],
          "Source": [
            {
              "Page": 26,
              "Source": "Pathfinder Playtest Rulebook"
            }
          ]
        }
      ]
    },
    {
      "Type": "Ancestry",
      "Name": "Gnome",
      "Info": [
        {
          "Description": "Long ago, early gnome ancestors migrated from the First World, realm of the fey. While it’s unclear why the first gnomes wandered to Golarion, their origin manifests in modern gnomes’ bizarre reasoning, eccentricity, obsessive tendencies, and what some see as naivete. These qualities are further reflected in their physical characteristics, such as spindly limbs, brightly colored hair, and childlike and extremely expressive facial features that further reflect their otherworldly origins.",
          "Overview": "Always hungry for new experiences, gnomes constantly wander both mentally and physically, attempting to stave off a terrible ailment that threatens all of their people. This affliction—the Bleaching—strikes gnomes who fail to dream, innovate, and take in new experiences as their progenitors did every hour of every day in the First World. The Bleaching slowly drains the literal color from gnomes, and it plunges the affected into states of deep depression that eventually claim their lives. Only a very few gnomes survive this scourge, becoming deeply morose and wise survivors known as bleachlings.\n  Most gnomes stand just over 3 feet tall and weigh little more than a young human child. Gnomes reach physical adulthood around the age of 18, though many retain a childlike curiosity even into adulthood. Gnomes rarely live longer than 400 years.\n Though they all trace their ancestry to the First World, gnomes otherwise have little culture they point to as their own. Instead, gnomes tend to pick and choose cultural practices of the region in which they live. Gnomes claim no nation in its entirety, and as a people they wouldn’t know what to do with such a state if one existed. Most gnomes consider adventure not a choice but a necessity, and gnome adventurers often collect mementos during their travels that allow them to relive their most exciting stories.\n  Gnomes eschew order, and therefore most worship deities who value individuality and nature, such as Cayden Cailean, Desna, Gozreh, and Shelyn.",
          "HP": 8,
          "Size": "Small",
          "Speed": 20,
          "Ability Boosts": [
            "Constitution",
            "Charisma",
            "Free"
          ],
          "Ability Flaw": [
            "Strength"
          ],
          "Languages": [
            "Common",
            "Gnomish",
            "Sylvan"
          ],
          "Bonus Languages": [
            "Draconic",
            "Dwarven",
            "Elven",
            "Goblin",
            "Jotun",
            "Orcish"
          ],
          "Traits": [
            "Gnome",
            "Humanoid"
          ],
          "Abilities": [
            "Low-Light Vision"
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 28
            }
          ]
        }
      ]
    },
    {
      "Type": "Ancestry",
      "Name": "Goblin",
      "Info": [
        {
          "Description": "It’s been almost 20 years since the end of the Goblinblood Wars that scorched the Chitterwood, forcing dozens of tribes into hiding. Now with new threats rising up, the many tribal elders have put aside their reckless ways in the hope of forging alliances that give them a chance at survival. While many have stayed to protect their homelands, others have become refugees, with some traveling to Absalom in search of a home that might offer them sanctuary in a world that does not trust them.",
          "Overview": "Even those goblins who break from their destructive past often subtly perpetuate some of the qualities that have been tied to the creatures for millennia. Goblins tend to flock to strong leaders, fiercely protecting those companions who have protected them from physical harm or offered a sympathetic ear when they learn of the goblins’ woes. Some goblins remain deeply fascinated with fire, or fearlessly devour a meal that might turn others’ stomachs. Others are endless tinkerers and view their companions’ trash simply as components of gadgets yet to be made. Occasionally, fellow adventurers find these proclivities unsettling or odd, but more often than not, goblins’ friends consider these qualities endearing.\n  Though goblins’ culture has splintered radically, their reputation across the Inner Sea region has changed little. As such, goblins who travel to larger cities are frequently subjected to derision, and as a result many goblins work twice as hard at proving their worth. Those who befriend a goblin quickly learn that while a goblin’s friendship might include all manners of pranks, such fun comes from a place of true acceptance—something that a goblin does not give freely.\n  Goblins reach adolescence by the age of 3 and adulthood 4 or 5 years later. In theory, goblins could live 50 years or more, but without anyone to protect them from each other or themselves, few live past 20 years of age. Goblins typically stand about 3 feet tall, with skin colors that range from green to gray to blue. Goblin adventurers typically worship Cayden Cailean.",
          "HP": 6,
          "Size": "Small",
          "Speed": 25,
          "Ability Boosts": [
            "Dexterity",
            "Charisma",
            "Free"
          ],
          "Ability Flaw": [
            "Wisdom"
          ],
          "Languages": [
            "Common",
            "Goblin"
          ],
          "Bonus Languages": [
            "Draconic",
            "Dwarven",
            "Gnoll",
            "Gnomish",
            "Halfling",
            "Orcish"
          ],
          "Traits": [
            "Goblin",
            "Humanoid"
          ],
          "Abilities": [
            "Darkvision"
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 30
            }
          ]
        }
      ]
    },
    {
      "Type": "Ancestry",
      "Name": "Halfling",
      "Info": [
        {
          "Description": "Claiming no place as their own, halflings control few settlements larger than villages. Instead, they frequently live among humans within the walls of larger cities, carving out small communities alongside other tall-folk. Many halflings lead perfectly fulfilling lives in the shadows of their larger neighbors, while others prefer a nomadic existence, traveling the world and taking advantage of opportunities and adventures as they come.",
          "Overview": "Many taller people dismiss halflings due to their size or, worse still, treat them like children. Halflings use these misconceptions and prejudices to their advantage, gaining access to opportunities and performing deeds of daring mischief or heroism. A halfling’s curiosity is tempered with caution, often leading to narrow escapes.\n  Despite their jovial and friendly nature, halflings don’t naturally tend to congregate together. They have no cultural homeland, and they instead weave themselves throughout the world’s societies. Halflings usually dwell among humans within the walls of cities, eking out whatever livings they can, many performing menial labor or simple service jobs. Some halflings reject such a life, instead turning to the open road, traveling from place to place in search of fortune and fame. These nomadic halflings often travel in small groups, sharing hardships and simple pleasures among close friends and family.\n  Halflings rarely grow to more than 3 feet in height. Tufts of hair warm the tops of their broad, tanned feet, and they prefer to walk barefoot. Halflings typically reach physical adulthood at the age of 20. A typical halfling can live to around 150 years old. Halflings are loyal to their friends and family, but they are not afraid to do what needs to be done in order to survive. Halflings favor gods that either grant luck, such as Desna, or encourage guile, like Norgorber, and many appreciate Cayden Cailean’s role as a liberator.\n  Halflings’ wanderlust and opportunism make them ideal adventurers, and one popular superstition even claims that traveling with a halfling is good luck.",
          "HP": 6,
          "Size": "Small",
          "Speed": 25,
          "Ability Boosts": [
            "Dexterity",
            "Wisdom",
            "Free"
          ],
          "Ability Flaw": [
            "Strength"
          ],
          "Languages": [
            "Common",
            "Halfling"
          ],
          "Bonus Languages": [
            "Dwarven",
            "Elven",
            "Gnomish",
            "Goblin"
          ],
          "Traits": [
            "Halfling",
            "Humanoid"
          ],
          "Abilities": [],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 32
            }
          ]
        }
      ]
    },
    {
      "Type": "Ancestry",
      "Name": "Human",
      "Info": [
        {
          "Description": "As unpredictable and varied as any the peoples on Golarion, humans have the exceptional drive and capacity to endure and expand. Though many civilizations thrived before humanity rose to prominence, humans have built some of the greatest and the most terrible societies throughout the course of history, and today they are the most populous people in the realms around the Inner Sea.",
          "Overview": "Humans’ empires and nations are vast, sprawling things, and their citizens carve names for themselves with the strength of their sword arms and the power of their spells. Humanity is both diverse and tumultuous, running the gamut from cruel to kind, from sinister to saintlike. And while humans build large nation states and free cities alike, many of them venture forth to explore, leaving their homes to map uncharted realms, search for long-lost treasure, or lead mighty armies to conquer their neighbors for no better reason than because they can.\n  Human variety also manifests in their governments, attitudes, and social norms. Though the oldest of human cultures trace their histories thousands of years into the past, when compared to the societies of the elves or dwarves, human civilizations seem to be in a constant state of flux, as empires fragment and new kingdoms subsume the old.\n  Humans typically reach physical adulthood at the age of 18. A typical human can live to be around 90 years old. Humans often intermarry with other peoples, giving rise to children who bear traits of both parents. The most notable half-humans are half-elves and half-orcs. Humans worship a wide range of gods and practice many different religions.\n  For many humans, adventuring serves as a means to an end, whether that end is accumulating wealth, striving for acclaim, increasing in social status, or uncovering arcane knowledge and power.",
          "HP": 8,
          "Size": "Medium",
          "Speed": 25,
          "Ability Boosts": [
            "Free",
            "Free"
          ],
          "Ability Flaw": [],
          "Languages": [
            "Common",
            "One additional language, selected from those to which you have access"
          ],
          "Bonus Languages": [
            "One of the languages from the list of common languages on page 40 or from other languages you have access to."
          ],
          "Traits": [
            "Human",
            "Humanoid"
          ],
          "Abilities": [],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 34
            }
          ]
        }
      ]
    }
  ],
  "Backgrounds": [
    {
      "Type": "Background",
      "Name": "Acolyte",
      "Info": [
        {
          "Description": "You spent your early days in a religious monastery or cloister. You may have traveled out into the world to spread the message of your religion or because you cast away the teachings of your faith, but deep inside you’ll always carry the lessons you learned.\n  Choose two ability boosts. One must be to Constitution or Wisdom, and one is a free ability boost.\n  You gain the Student of the Canon skill feat, and you’re trained in the Lore skill corresponding to your deity (such as Desna Lore or Sarenrae Lore).",
          "Ability Boosts": [
            [
              "Constitution",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Student of the Canon"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Diety",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Acrobat",
      "Info": [
        {
          "Description": "In a circus or on the streets, you earned your pay by performing as an acrobat. You might have turned to adventuring when the money dried up, or when you learned to put skills to better use.\n  Choose two ability boosts. One must be to Strength or Dexterity, and one is a free ability boost. \n  You gain the Steady Balance skill feat, and you’re trained in the Circus Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Dexterity"
            ],
            "Free"
          ],
          "Feat": [
            "Steady Balance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Circus",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Animal Whisperer",
      "Info": [
        {
          "Description": "You have always felt a connection to animals, and it was only a small leap to learn to train them. As you travel, you continuously encounter different creatures, befriending them along the way. \n  Choose two ability boosts. One must be to Wisdom or Charisma, and one is a free ability boost.\n  You gain the Train Animal skill feat, and you’re trained in the Animal Lore skill.",
          "Ability Boosts": [
            [
              "Wisdom",
              "Charisma"
            ],
            "Free"
          ],
          "Feat": [
            "Train Animal"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Animal",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Barkeep",
      "Info": [
        {
          "Description": "You have five specialties: hefting barrels, polishing steins, drinking, drinking, and drinking. You ran or worked in a bar, where you learned how to hold your liquor and rowdily socialize.\n  Choose two ability boosts. One must be to Constitution or Charisma, and one is a free ability boost.\n  You gain the Hobnobber skill feat, and you’re trained in the Alcohol Lore skill.",
          "Ability Boosts": [
            [
              "Constitution",
              "Charisma"
            ],
            "Free"
          ],
          "Feat": [
            "Hobnobber"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Alcohol",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Blacksmith",
      "Info": [
        {
          "Description": "You were a blacksmith or a blacksmith’s apprentice, and during countless hours toiling at the forge, you learned how to smith armor and weapons. Perhaps you worked hard each day and dreamed of adventure each night, or perhaps the adventuring life was thrust upon you by a pivotal event.\n  Choose two ability boosts. One must be to Strength or Intelligence, and one is a free ability boost.\n  You gain the Specialty Crafting skill feat for blacksmithing, and you’re trained in the Smithing Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Intelligence"
            ],
            "Free"
          ],
          "Feat": [
            "Specialty Crafting"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Smithing",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Criminal",
      "Info": [
        {
          "Description": "As an unscrupulous independent or as a member of an underworld organization, you lived a life of crime. You might have become an adventurer to seek redemption, to escape the law, or simply to get access to bigger and better loot.\n  Choose two ability boosts. One must be to Dexterity or Intelligence, and one is a free ability boost.\n  You gain the Experienced Smuggler skill feat, and you’re trained in the Underworld Lore skill.",
          "Ability Boosts": [
            [
              "Dexterity",
              "Intelligence"
            ],
            "Free"
          ],
          "Feat": [
            "Experienced Smuggler"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Underworld",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Entertainer",
      "Info": [
        {
          "Description": "Through an education in the arts or sheer, dogged practice, you learned to entertain crowds. You might have been an actor, a dancer, a musician, a magician, or any other sort of performer.\n  Choose two ability boosts. One must be to Dexterity or Charisma, and one is a free ability boost.\n  You gain the Fascinating Performance skill feat, and you’re trained in the Entertainment Lore skill.",
          "Ability Boosts": [
            [
              "Dexterity",
              "Charisma"
            ],
            "Free"
          ],
          "Feat": [
            "Fascinating Performance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Entertainment",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Farmhand",
      "Info": [
        {
          "Description": "With a strong back and an understanding of seasonal cycles, you tilled the land and tended crops. Your farm could have been razed by invaders, you could have lost the family tying you to the land, or you might have simply tired of the drudgery, but at some point you became an adventurer.\n  Choose two ability boosts. One must be to Constitution or Wisdom, and one is a free ability boost.\n  You gain the Assurance skill feat with Athletics, and you’re trained in the Farming Lore skill.",
          "Ability Boosts": [
            [
              "Constitution",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Assurance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Farming",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Gladiator",
      "Info": [
        {
          "Description": "The bloody games of the arena taught you the art of combat. Before you attained true fame, you departed—or escaped—thearena to explore the world. Your skill at drawing both blood anda crowd’s attention pay off in a new adventuring life.\n  Choose two ability boosts. One must be to Strength or Charisma, and one is a free ability boost.\n  You gain the Fascinating Performance skill feat, and you’re trained in the Gladiatorial Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Charisma"
            ],
            "Free"
          ],
          "Feat": [
            "Fascinating Performance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Gladitorial",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 38
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Hunter",
      "Info": [
        {
          "Description": "You stalk and take down animals and other creatures of the wild. Skinning animals, harvesting their flesh, and cooking them were also part of your training, all of which can give you useful resources while you adventure.\n  Choose two ability boosts. One must be to Dexterity or Wisdom, and one is a free ability boost.\n  You gain the Survey Wildlife skill feat, and you’re trained in the Hunting Lore skill.",
          "Ability Boosts": [
            [
              "Dexterity",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Survey Wildlife"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Hunting",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Laborer",
      "Info": [
        {
          "Description": "You have spent years performing arduous physical labor, perhaps against your will. It was a difficult life, but you somehow survived. You may have embraced adventuring as an easier method to make your way in the world, or you might adventure under someone else’s command.\n  Choose two ability boosts. One must be to Strength or Constitution, and one is a free ability boost.\n  You gain the Robust Recovery skill feat, and you’re trained in the Labor Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Constitution"
            ],
            "Free"
          ],
          "Feat": [
            "Robust Recovery"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Labor",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Merchant",
      "Info": [
        {
          "Description": "In a dusty shop, market stall, or merchant caravan, you bartered wares for coin and trade goods. The skills you picked up still apply in the adventuring life, in which a deal on a suit of armor could save your life.\n  Choose two ability boosts. One must be to Intelligence or Charisma, and one is a free ability boost.\n  You gain the Bargain Hunter skill feat, and you’re trained in the Mercantile Lore skill.",
          "Ability Boosts": [
            [
              "Charisma",
              "Intelligence"
            ],
            "Free"
          ],
          "Feat": [
            "Bargain Hunter"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Mercantile",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Noble",
      "Info": [
        {
          "Description": "To the common folk, the life of a noble seems one of idyllic luxury, but growing up as a noble or member of the aspiring gentry, you know the reality: a noble’s lot is obligation and intrigue. Whether you seek to escape your duties by adventuring or to thereby better your station, you have traded silks and pageantry for an adventurer’s life.\n  Choose two ability boosts. One must be to Intelligence or Charisma, and one is a free ability boost.\n  You gain the Courtly Graces skill feat, and you’re trained in the Nobility Lore skill.",
          "Ability Boosts": [
            [
              "Charisma",
              "Intelligence"
            ],
            "Free"
          ],
          "Feat": [
            "Courtly Graces"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Nobility",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Nomad",
      "Info": [
        {
          "Description": "Traveling far and wide, you picked up basic tactics for surviving on the road and in unknown lands, getting by with few supplies and even fewer comforts. As an adventurer, you travel still, often into even more dangerous places.\n  Choose two ability boosts. One must be to Constitution or Wisdom, and one is a free ability boost.\n  You gain the Assurance skill feat with Survival, and you’re trained in a Lore skill related to one terrain you traveled in (such as Desert Lore or Swamp Lore).",
          "Ability Boosts": [
            [
              "Constitution",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Assurance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Terrain",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Sailor",
      "Info": [
        {
          "Description": "You heard the call of the sea from a young age. Perhaps you signed onto a merchant’s vessel, joined the navy, or even fell in with a crew of pirates and scallywags.\n  Choose two ability boosts. One must be to Strength or Dexterity, and one is a free ability boost.\n  You gain the Underwater Marauder skill feat, and you’re trained in the Sailing Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Dexterity"
            ],
            "Free"
          ],
          "Feat": [
            "Underwater Marauder"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Sailing",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Scholar",
      "Info": [
        {
          "Description": "You have a knack for learning, and from a young age, you sequestered yourself from the outside world to learn all that you could. You’ve read about so many wondrous places and things in your books, and you’ve always dreamed about one day seeing the real things. Eventually, that curiosity led you to leave your studies and become an adventurer.\n  Choose two ability boosts. One must be to Intelligence or Wisdom, and one is a free ability boost.\n  Choose Arcana, Nature, Occultism, or Religion; you gain the Assurance skill feat in your chosen skill. You’re trained in the Academia Lore skill.",
          "Ability Boosts": [
            [
              "Intelligence",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Assurance"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Academia",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Scout",
      "Info": [
        {
          "Description": "You called the wilderness home as you hunted game, found trails, and guided travelers. Your wanderlust could have called you to the adventuring life, or perhaps you were serving as a scout for soldiers and found you liked battle.\n  Choose two ability boosts. One must be to Dexterity or Wisdom, and one is a free ability boost.\n  You gain the Forager skill feat, and you’re trained in the Scouting Lore skill.",
          "Ability Boosts": [
            [
              "Dexterity",
              "Wisdom"
            ],
            "Free"
          ],
          "Feat": [
            "Forager"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Scouting",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Street Urchin",
      "Info": [
        {
          "Description": "You eked out a living by picking pockets on the streets of a major city, never knowing where you’d find your next meal. While some folk adventure for the glory, you adventure as a means of survival.\n  Choose two ability boosts. One must be to Dexterity or Intelligence, and one is a free ability boost.\n  You gain the Pickpocket skill feat, and you’re trained in the Underworld Lore skill.",
          "Ability Boosts": [
            [
              "Dexterity",
              "Intelligence"
            ],
            "Free"
          ],
          "Feat": [
            "Pickpocket"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Underworld",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    },
    {
      "Type": "Background",
      "Name": "Warrior",
      "Info": [
        {
          "Description": "As a warrior in a tribe or a member of a militia or army, you waded into battle in your younger days. You might have wanted to break out from the regimented structure of these forces, or could have always been as independent a warrior as you are now.\n  Choose two ability boosts. One must be to Strength or Constitution, and one is a free ability boost.\nYou gain the Quick Repair skill feat, and you’re trained in the Warfare Lore skill.",
          "Ability Boosts": [
            [
              "Strength",
              "Constitution"
            ],
            "Free"
          ],
          "Feat": [
            "Quick Repair"
          ],
          "Proficiency": [
            {
              "Name": "Lore",
              "Subname": "Warfare",
              "Type": "Skill",
              "Value": "Trained"
            }
          ],
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 39
            }
          ]
        }
      ]
    }
  ],
  "Classes": [
    {
      "Type": "Class",
      "Name": "Alchemist",
      "Info": [
        {
          "Description": "There’s no sight more beautiful to you than a strange brew bubbling in your laboratory’s beakers, and you consume your various creations with abandon. Perhaps you’re fascinated with uncovering the secrets of magic and science, or perhaps you simply like to watch volatile chemical reactions. Regardless, you’re constantly experimenting in your lab or on the go with inventive concoctions tweaked for any eventuality. With your fearlessness in the face of risk, your unique path toward greatness is lined with alchemical brews that push your mind and body to their limits.",
          "Key Ability": [
            "Intelligence"
          ],
          "HP": 8,
          "Skills": 2,
          "Playing": "Players of alchemist characters might approach gameplay in the following ways:\n• During combat, you lob bombs at your foes and harry your enemies while supporting the rest of the party with your potent elixirs. At higher levels, you toughen your body using mutagens.\n• During social encounters, you provide knowledge and experience about alchemical items and related secrets, like poisons and diseases.\n• In exploration mode, you keep an eye out for trouble with your bombs at the ready while giving advice on all things alchemical and mysterious.\n• In downtime mode, you spend time in an alchemical lab brewing elixirs, making bombs, and furthering your alchemical knowledge.",
          "Roleplaying": "Alchemists pursue scientific innovation above all else, combining incredible powers from the natural world through the force of their keen intellect and insatiable curiosity.\n\nIF YOU’RE AN ALCHEMIST, YOU LIKELY...\n• Enjoy tinkering with strange formulas and alchemical reagents, often with single-minded dedication and recklessness that give others pause.\n• Get a kick out of wreaking havoc with the alchemical concoctions you’ve made, and enjoy watching things burn, dissolve, freeze, and jolt.\n• Endlessly experiment toward the discovery of new, more potent alchemical and magical tools.\n\nOTHERS PROBABLY...\n• Think you’re at least a bit strange and don’t understand your zeal for alchemy, creativity, and invention.\n• Fear that your creations are dangerous or volatile—or both.\n• Assume that if you haven’t caused a catastrophe with your experimentations, you inevitably will.\n• Think that you’re some kind of sorcerer or an eccentric wizard and don’t understand that you’re not a spellcaster; real spellcasters clumsily dabbling in alchemy only heighten this misconception.",
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Alchemical Bombs",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Arcana",
            "Crafting",
            "Medicine"
          ],
          "Advancement": [
            [
              "Class Feat",
              "Advanced Alchemy",
              "Formula Book",
              "Studied Resonance"
            ],
            [
              "Class Feat"
            ],
            [
              "Empower bombs"
            ],
            [
              "Class Feat"
            ],
            [
              "Mutagen Crafting"
            ],
            [
              "Class Feat"
            ],
            [
              "Empower bombs"
            ],
            [
              "Class Feat"
            ],
            [
              "Expanded Resonance"
            ],
            [
              "Class Feat"
            ],
            [
              "Empower Bombs"
            ],
            [
              "Class Feat"
            ],
            [
              "Double Elixir"
            ],
            [
              "Class Feat"
            ],
            [
              "Empower Bombs"
            ],
            [
              "Class Feat"
            ],
            [
              "Alchemical Alacrity"
            ],
            [
              "Class Feat"
            ],
            [
              "Empower Bombs"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 44
            }
          ]
        },
        {
          "Skills": 3,
          "Source": [
            {
              "Source": "Pathfinder Playtest Errata",
              "Page": 1
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Barbarian",
      "Info": [
        {
          "Description": "Rage consumes you in battle. You delight in carving through your enemies using powerful weapons and wreaking havoc, relying on astonishing durability, without needing complicated techniques or rigid training. You associate your rage with a traditional symbol of affinity known as a totem, which might take the form of an animal, a spirit, or a part of yourself. To many barbarians, brute force is a hammer and every problem looks like a nail, whereas others try to hold back the dark emotions inside them and release them only when it matters most.",
          "Playing": "Players of barbarian characters might approach gameplay in the following ways.\n• During combat, you Rage and then rush to the front lines to smash your way through. Offense is the best defense, since you’ll need to drop your foes before they can exploit your relatively low defenses. Your anger-fueled fury burns out quickly, so you might spend a round waiting until you can Rage again.\n• During social encounters, you use intimidation to get what you need, especially when gentler forms of persuasion can’t get the job done.\n• In exploration mode, you look out for danger while remaining ready to rush headfirst into battle in an instant. You climb the challenging rock wall and drop a rope for the others to follow, and you wade into the risky currents to reach the hidden switch beneath the water’s surface. And if something needs breaking, you’re up to the task!\n• In downtime mode, you might head to a tavern to carouse, build up the fearsome legend of your mighty deeds, or recruit followers to become a warlord in your own right.",
          "Roleplaying": "Barbarians are powerful, deeply emotional, and bold.\n\nIF YOU’RE A BARBARIAN, YOU LIKELY...\n• Have a deep-seated well of anger, hatred, or frustration.\n• Prefer a straightforward approach to one requiring patience and tedium.\n• Engage in a regimen of intense physical fitness—and punch anyone who says this conflicts with your distaste for patience and tedium.\n\nOTHERS PROBABLY...\n• Think you’re an uncivilized savage, or at least a boorish lout unfit for high society.\n• Never doubt your courage.\n• Believe you have bizarre superstitions and poor education and might be illiterate.\n• Expect you to have no restraint or control of your temper, so they walk on eggshells around you and gripe about you behind your back.",
          "Key Ability": [
            "Strength"
          ],
          "HP": 12,
          "Skills": 3,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Expert"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Martial Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Medium Armor",
              "Type": "Armor",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Acrobatics",
            "Athletics",
            "Intimidation"
          ],
          "Advancement": [
            [
              "Class Feat",
              "Rage",
              "Totem"
            ],
            [
              "Class Feat"
            ],
            [
              "Critical Brutality"
            ],
            [
              "Class Feat"
            ],
            [
              "Deny Advantage"
            ],
            [
              "Class Feat"
            ],
            [
              "Juggernaut"
            ],
            [
              "Class Feat"
            ],
            [
              "Raging Resistance"
            ],
            [
              "Class Feat"
            ],
            [
              "Mighty Rage"
            ],
            [
              "Class Feat"
            ],
            [
              "Improved Juggernaut",
              "Weapon Fury"
            ],
            [
              "Class Feat"
            ],
            [
              "Indomitable Will"
            ],
            [
              "Class Feat"
            ],
            [
              "Tireless Rage"
            ],
            [
              "Class Feat"
            ],
            [
              "Devastating Strikes"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 52
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Bard",
      "Info": [
        {
          "Description": "You are a master of artistry, a scholar of hidden secrets, and a captivating persuader. Using powerful performances, you influence minds and elevate souls to new levels of heroics. You might use your powers to become a charismatic leader, or perhaps a counselor, manipulator, scholar, scoundrel, or virtuoso. While your versatility allows some to consider you a jack-of-all-trades and a beguiling ne’er-do-well who spends too much time in taverns, it’s dangerous to dismiss you as a master of none.",
          "Playing": "Players of bard characters might approach gameplay in the following ways:\n• During combat, you use magical performances to alter the odds in your group’s favor. You can alternate between helpful spells, attacks, and healing as needed.\n• During social encounters, you persuade, prevaricate, and threaten with ease.\n• While exploring, you’re a font of knowledge and you perform to assist allies.\n• In downtime, you can earn money and prestige with your performances, gaining a name for yourself and acquiring patrons. You might even found a bardic college of your own!",
          "Roleplaying": "Bards know obscure lore, perform skillfully, and have silver tongues.\n\nIF YOU’RE A BARD, YOU LIKELY...\n• Have a passion for your art so strong you forge a spiritual connection.\n• Take point when tact and nonviolent solutions are required.\n• Follow your muse, whether it’s a fey creature, a philosophical concept, a psychic force, or a deity of art or music, and you follow it to learn secret lore that few others have.\n\nOTHERS PROBABLY...\n• Underestimate you compared to other spellcasters, believing you are little more than a foppish minstrel and overlooking the subtle power of your magic.\n• Relish the opportunity to invite you to social events, either as a performer or a guest, but still consider you to be something of a curiosity in their social circles.\n• Respond favorably to your social charm and abilities but remain suspicious of your mental magic.",
          "Key Ability": [
            "Charisma"
          ],
          "HP": 8,
          "Skills": 7,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Expert"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Longsword",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Rapier",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Sap",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Shortsword",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Shortbow",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Whip",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Shields",
              "Type": "Shields",
              "Value": "Trained"
            },
            {
              "Name": "Occult",
              "Type": "Spells",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Crafting",
            "Deception",
            "Diplomancy",
            "Intimidation",
            "Occultism",
            "Performance",
            "Society"
          ],
          "Advancement": [
            [
              "First Compositions",
              "Muse",
              "Occult Spellcasting",
              "Spell Repertoire"
            ],
            [
              "Class Feat"
            ],
            [
              "2nd-level Spells",
              "Spontaneous Heightening"
            ],
            [
              "Class Feat"
            ],
            [
              "3rd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "4th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "5th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "6th-level Spells"
            ],
            [
              "Expert Spellcaster"
            ],
            [
              "7th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "8th-level Spells"
            ],
            [
              "Master Spellcaster"
            ],
            [
              "9th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Spellcaster"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 62
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Cleric",
      "Info": [
        {
          "Description": "Deities work their will upon the world in infinite ways, and you serve as one of their most stalwart mortal servants. Blessed with divine magic granted through the grace of your deity, you live the ideals of your faith, adorn yourself with the symbols of your church, and train diligently to wield the weapon favored by your deity. Your spells might protect and heal your allies, or they might punish foes and lay waste to enemies of your faith, as your deity wills. Yours is a life of devotion, spreading the teachings of your faith through both thought and deed.",
          "Playing": "Players of cleric characters might approach gameplay in the following ways.\n• During combat, you trade off between casting spells and attacking with weapons—typically the favored weapon of your deity. Most of your spells can boost, protect, or heal your allies. Your ability to channel energy lets you cast heal for your allies or harm on your enemies more often, depending on your deity.\n• During social encounters, you might make diplomatic overtures or deliver impressive speeches. Because you’re wise, you also pick up on falsehoods others tell.\n• In exploration mode, you detect nearby magic and interpret any religious writing you come across. You might also concentrate on a protective spell for your allies in case of attack. After a battle or hazard, you might heal anyone who was hurt.\n• In downtime, you might perform services at a temple, travel to spread the word of your deity, research scripture, celebrate holy days, or even found a new temple.",
          "Roleplaying": "Clerics have an unmatched reputation for devotion to their deities.\n\nIF YOU’RE A CLERIC, YOU LIKELY...\n• Have an immediate affinity with other worshipers of your deity.\n• Visit the temples and holy places sacred to your faith.\n• Know the teachings of your religion’s holy texts and how they apply to a dilemma.\n• Cooperate with your allies, provided they don’t ask you to go against divine will.\n\nOTHERS PROBABLY...\n• Assume you’re a fanatic in all things.\n• Expect you to heal their wounds.\n• Rely on you to interact with other religious figures.",
          "Key Ability": [
            "Wisdom"
          ],
          "HP": 8,
          "Skills": 5,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Favored Weapon",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Medium Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Shields",
              "Type": "Shields",
              "Value": "Trained"
            },
            {
              "Name": "Divine",
              "Type": "Spells",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Diplomancy",
            "Medicine",
            "Performance",
            "Religion",
            "Deity Skill"
          ],
          "Advancement": [
            [
              "Anathema",
              "Channel Energy",
              "Deity and Domain",
              "Divine Spellcasting"
            ],
            [
              "Class Feat"
            ],
            [
              "2nd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "3rd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "4th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "5th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "6th-level Spells"
            ],
            [
              "Expert Spellcaster"
            ],
            [
              "7th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "8th-level Spells"
            ],
            [
              "Master Spellcaster"
            ],
            [
              "9th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Spellcaster"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 68
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Druid",
      "Info": [
        {
          "Description": "The power of nature is impossible to resist. It can bring ruin to the stoutest fortress in minutes, reducing even the mightiest works to rubble, burning them to ash, burying them beneath an avalanche of snow, or drowning them beneath the waves. It can provide endless bounty and breathtaking splendor to those who respect it and an agonizing death to those who take it too lightly. You are one of those who hear nature’s call. You stand in awe of the majesty of its power and give yourself over to its service.",
          "Playing": "Players of druid characters might approach gameplay in the following ways:\n• During combat, you call upon the forces of nature to defeat your enemies and protect your allies. You can cast spells drawing upon primal magic to summon deadly animals to fight at your side, grant resilience to you and your friends, or heal their wounds. Depending on your bond to nature, you might also call upon powerful elemental magic or even change shape into a terrifying beast to fight with tooth and claw.\n• During social encounters, you represent balance and a reasoned approach to problems, looking for solutions that not only are best for the natural world, but also allow the creatures within it to live in harmony and peace. You often propose compromises that allow both sides to gain what they truly need, even if they can’t have all that they desire.\n• In exploration mode, your skills in nature are invaluable. You can track down enemies, navigate through the wilderness, or use your spells to detect any magical auras around you. You might even ask wild animals to assist your group in your travels with their extraordinary senses and scouting abilities.\n• In downtime mode, you might craft magic items or potions. Alternatively, your tie to nature might lead you to tend to an area of the wild, befriending its beasts and healing the wounds caused by civilization. You might even attempt to teach people sustainable techniques that allow them to subsist off the land without harming the natural balance.",
          "Roleplaying": "Druids are the living embodiment of nature, acting as its agent; you protect the wild places from harm and speak for their interests in more civilized lands.\n\nIF YOU’RE A DRUID, YOU LIKELY...\n• Have a deep and meaningful respect for the power of nature.\n• Are in constant awe of the natural world, eager to share it with others but cautious of their influence.\n• Treat plants and animals as allies in your quest, working with them toward your goals.\n\nOTHERS PROBABLY...\n• View you as a representative of nature, and might even assume you can control it.\n• Look at you as a recluse who avoids society and cities, preferring to live in the wild.\n• Treat you as a mystic, similar to a priest, but answering only to the forces of nature.",
          "Key Ability": [
            "Wisdom"
          ],
          "HP": 8,
          "Skills": 4,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Scimitar",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained",
              "Special": "Non Metal"
            },
            {
              "Name": "Medium Armor",
              "Type": "Armor",
              "Value": "Trained",
              "Special": "Non Metal"
            },
            {
              "Name": "Light Shields",
              "Type": "Shields",
              "Value": "Trained",
              "Special": "Non Metal"
            },
            {
              "Name": "Heavy Shields",
              "Type": "Shields",
              "Value": "Trained",
              "Special": "Non Metal"
            },
            {
              "Name": "Divine",
              "Type": "Spells",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Crafting",
            "Nature",
            "Survival",
            "Order Skill"
          ],
          "Advancement": [
            [
              "Anathema",
              "Druidic Language",
              "Druidic Order",
              "Primal Spellcasting",
              "Wild Empathy"
            ],
            [
              "Class Feat"
            ],
            [
              "2nd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "3rd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "4th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "5th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "6th-level Spells"
            ],
            [
              "Expert Spellcaster"
            ],
            [
              "7th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "8th-level Spells"
            ],
            [
              "Master Spellcaster"
            ],
            [
              "9th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Spellcaster"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 78
            }
          ]
        },
        {
          "Skills": 3,
          "Source": [
            {
              "Source": "Pathfinder Playtest Errata",
              "Page": 1
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Fighter",
      "Info": [
        {
          "Description": "Fighting for honor, greed, loyalty, or simply your own uncontrollable bloodlust, you are an undisputed master of weaponry and combat techniques. You combine your actions through clever combinations of opening moves, finishing strikes, and counterattacks whenever your foes are unwise enough to drop their guard. Whether you are a knight, mercenary, sharpshooter, or blademaster, you hone your martial skills to an art form and perform devastating critical attacks on your enemies.",
          "Playing": "Players of fighter characters might approach gameplay in the following ways.\n• During combat, you stand between allies and enemies if you’re a melee fighter. You draw fire and deal out major damage with unmatched accuracy. Your ability to attack foes who move away lets you punish those who try to get past you. If you’re a ranged fighter, you deliver precise shots from a distance. It’s likely you’ll benefit from spells from spellcasting allies to make you tougher, faster, or better at attacking.\n• During social encounters, you can be an intimidating presence. This can be good when negotiating with enemies but is sometimes a liability in more genteel interactions.\n• In exploration mode, you keep up your defenses in preparation for combat or keep an eye out for hidden threats. Physical challenges in your way fall to your prowess as you break down doors, lift obstacles, climb adeptly, or leap across pits.\n• In downtime mode, you might work for a living doing manual labor. You could also learn a craft, repairing your gear and creating new armaments. If you know old techniques you no longer favor, you might train yourself in new ones. If you’ve established your reputation, you might even build an organization or a stronghold of your own.",
          "Roleplaying": "Fighters master martial combat and the weapons and armor needed to go toe to toe with deadly monsters.\n\nIF YOU’RE A FIGHTER, YOU LIKELY...\n• Know the purpose and quality of every weapon and piece of armor you own.\n• Have your friends’ backs no matter the situation.\n• Recognize that the danger of an adventurer’s life must be balanced out with great revelry or ambitious works.\n• Have little patience for puzzles or problems that require detailed logic or study.\n\nOTHERS PROBABLY...\n• Find you intimidating until they get to know you—and maybe even after they get to know you.\n• Think you’re all brawn and no brains.\n• Expect you to be a mercenary or a soldier and to have no authority of your own.",
          "Key Ability": [
            "Strength",
            "Dexterity"
          ],
          "HP": 10,
          "Skills": 3,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Expert"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Expert"
            },
            {
              "Name": "Martial Weapons",
              "Type": "Weapons",
              "Value": "Expert"
            },
            {
              "Name": "Exotic Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Shields",
              "Type": "Shields",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Acrobatics",
            "Athletics",
            "Crafting"
          ],
          "Advancement": [
            [
              "Attack of Opportunity",
              "Class Feat"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Bravery"
            ],
            [
              "Class Feat"
            ],
            [
              "Battlefield Surveyor"
            ],
            [
              "Class Feat"
            ],
            [
              "Combat Flexibility"
            ],
            [
              "Class Feat"
            ],
            [
              "Heavy Armor Expertise"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Specialization"
            ],
            [
              "Class Feat"
            ],
            [
              "Improved Flexibility"
            ],
            [
              "Class Feat"
            ],
            [
              "Armor Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Legend"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 86
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Monk",
      "Info": [
        {
          "Description": "The strength of the fist flows from the power of mind and spirit. You seek to attain perfection—to hone your body into a flawless instrument and your mind into an orderly bastion of wisdom. You are a fierce combatant renowned for your martial arts skills and your ability to enter stances to achieve different outcomes during a fight. While the challenges of mastering fighting styles and conquering powerful foes drive you to greater and greater heights, you also enjoy meditating on philosophical questions and discovering new ways to obtain peace and enlightenment.",
          "Playing": "Players of monk characters might approach gameplay in the following ways:\n• During combat, you speed into the fray, dodging or leaping past obstacles with acrobatic maneuvers. You strike opponents in a rapid flurry of attacks, using bare fists or wielding specialized weapons that you mastered during your monastic training. Stances let you change up your combat style for different situations, and ki abilities allow you to heal yourself or soar through the air.\n• During social encounters, your perceptiveness lets you see through falsehoods, and your philosophical training provides insight into any situation.\n• In exploration mode, you climb up walls, dodge traps, overcome obstacles, and leap over pits. You usually stay toward the outside of the group to protect more vulnerable members, and you’re suited to looking for danger or moving stealthily.\n• In downtime mode, you diligently exercise, eat healthy foods, meditate, and study philosophies. You might also take up a craft that you strive to perfect.",
          "Roleplaying": "Seldom seen outside their monasteries, monks have a reputation as powerful but taciturn warriors.\n\nIF YOU’RE A MONK, YOU LIKELY...\n• Maintain a regimen of physical training and meditation.\n• Face adversity with a calm and measured approach, never panicking or succumbing to despair.\n• Look to the future for ways you can improve while remaining at peace with your present self.\n\nOTHERS PROBABLY...\n• Think you’re more than a bit uptight, with your vows and rules.\n• Marvel at your feats of physical prowess.\n• Come to you for philosophical instruction.",
          "Key Ability": [
            "Strength",
            "Dexterity"
          ],
          "HP": 10,
          "Skills": 3,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Unarmed Attacks",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Armor",
              "Type": "Armor",
              "Value": "Untrained"
            }
          ],
          "Signature Skills": [
            "Acrobatics",
            "Athletics",
            "Religion"
          ],
          "Advancement": [
            [
              "Flurry of Blows",
              "Graceful Expertise",
              "Class Feat",
              "Powerful Fist"
            ],
            [
              "Class Feat"
            ],
            [
              "Incredible Movement",
              "Magic Strikes"
            ],
            [
              "Class Feat"
            ],
            [
              "Metal Strikes"
            ],
            [
              "Class Feat",
              "Incredible Movement"
            ],
            [
              "Path to Perfection"
            ],
            [
              "Class Feat"
            ],
            [
              "Fierce Flurry",
              "Incredible Movement"
            ],
            [
              "Class Feat"
            ],
            [
              "Second Path to Perfection"
            ],
            [
              "Class Feat",
              "Incredible Movement"
            ],
            [
              "Graceful Mastery",
              "Unarmed Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Third Path to Perfection",
              "Incredible Movement"
            ],
            [
              "Class Feat"
            ],
            [
              "Adamantine Strikes",
              "Graceful Legend"
            ],
            [
              "Class Feat",
              "Incredible Movement"
            ],
            [
              "Perfected Form"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 96
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Paladin",
      "Info": [
        {
          "Description": "You are a champion of justice, a holy servant of a good and lawful deity who takes up the mantle of a restrictive code to provide certainty and hope to the innocent. You have powerful defenses that you share freely with your allies and innocent bystanders, but when the time comes to punish the wicked, you use your holy power to end the threat of evil. Your devotion also attracts the attention of holy spirits who aid you on your journey. Others can count on you to adhere to your code of conduct, and they trust you at your word.",
          "Playing": "Players of paladin characters might approach gameplay in the following ways:\n• During combat, you get into the enemy’s face while carefully positioning yourself to protect your allies.\n• During social encounters, you are a voice of hope, striving to reach a peaceful solution that strengthens bonds and yields good results for all.\n• In exploration mode, you overcome barriers both physical and spiritual, providing inspiration to your allies through your actions and guidance when requested, rather than sanctimoniously preaching about their shortcomings.\n• In downtime mode, you spend much of your time on charity work and fulfilling the tenets of your code, but that doesn’t mean there isn’t time to take up a craft or hobby.",
          "Roleplaying": "Paladins are champions of justice, acting as agents against the forces of evil.\n\nIF YOU’RE A PALADIN, YOU LIKELY...\n• Believe there is always hope for good to triumph over evil, no matter how grim the odds.\n• Know the ends don’t justify the means, since evil acts increase the power of evil.\n• Have a strong sense of justice and are incredibly frustrated when political corruption leads to a miscarriage of justice.\n\nOTHERS PROBABLY...\n• Believe you an inflexible martinet devoted to every rule and unwilling to compromise.\n• Worry you secretly despise them for not living up to your impossible standard.\n• Assume you are forced to perform any favor free of charge in the name of charity.\n• See you as a symbol of hope, especially in a time of great need.\n• Know that you’ve sworn an oath not to lie and that they can take you at your word.",
          "Key Ability": [
            "Strength"
          ],
          "HP": 10,
          "Skills": 4,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Martial Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Shields",
              "Type": "Shields",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Athletics",
            "Crafting",
            "Diplomacy",
            "Religion"
          ],
          "Advancement": [
            [
              "Champion Powers",
              "Code of Conduct",
              "Deific Weapon",
              "Class Feat",
              "Retributive Strike"
            ],
            [
              "Class Feat"
            ],
            [
              "Righteous Ally"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Expertise"
            ],
            [
              "Class Feat"
            ],
            [
              "Armored Fortitude"
            ],
            [
              "Class Feat"
            ],
            [
              "Holy Smite"
            ],
            [
              "Class Feat"
            ],
            [
              "Aura of Justice"
            ],
            [
              "Class Feat"
            ],
            [
              "Armor Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Armor"
            ],
            [
              "Class Feat"
            ],
            [
              "Hero's Defiance"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 104
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Ranger",
      "Info": [
        {
          "Description": "For some rangers, civilization is so corrupt it wears down the soul, yet so beneficial it needs protecting from wild things that stalk the hinterlands. For others, nature needs to be protected from the greedy hands of civilized people wishing to tame its beauty and plunder its treasures. You could champion either goal, or straddle the line of both. You might be a scout, tracker, or hunter of fugitives or beasts, haunting the edge of civilization or exploring the wilds. Living off the land, you are skilled at spotting and taking down both opportune prey and hated enemies.",
          "Playing": "Players of ranger characters might approach gameplay in the following ways:\n• During combat, you target and brutalize your chosen foe with either a bow or melee weapons, while supporting your allies with your skills.\n• During social encounters, you keep an eye out for trouble, constantly alert for danger even when it’s not overt.\n• In exploration mode, you guide your allies through the wilderness.\n• In downtime mode, you might craft weapons and snares to improve your chances.",
          "Roleplaying": "Rangers are often seen as loners, standing apart from society.\n\nIF YOU’RE A RANGER, YOU LIKELY...\n• Enjoy the thrill of the hunt.\n• Respect the raw power of nature and understand how to make the best of its bounty.\n• Scout out ahead of the party, reconnoitering dangers before combat begins.\n\nOTHERS PROBABLY...\n• Expect you to be quiet and maybe taciturn.\n• Think there is something dangerous and wild about you.\n• Call upon you to protect them from the wilds or the encroachment of civilization.",
          "Key Ability": [
            "Dexterity",
            "Strength"
          ],
          "HP": 10,
          "Skills": 6,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Expert"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Martial Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            },
            {
              "Name": "Medium Armor",
              "Type": "Armor",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Acrobatics",
            "Athletics",
            "Crafting",
            "Nature",
            "Stealth",
            "Survival"
          ],
          "Advancement": [
            [
              "Hunt Target",
              "Class Feat"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Expertise"
            ],
            [
              "Class Feat"
            ],
            [
              "Trackless Step"
            ],
            [
              "Class Feat"
            ],
            [
              "Evasion"
            ],
            [
              "Class Feat"
            ],
            [
              "Nature's Edge"
            ],
            [
              "Class Feat"
            ],
            [
              "Wild Stride"
            ],
            [
              "Class Feat"
            ],
            [
              "Weapon Mastery"
            ],
            [
              "Class Feat"
            ],
            [
              "Improved Evasion"
            ],
            [
              "Class Feat"
            ],
            [
              "Masterful Hunter"
            ],
            [
              "Class Feat"
            ],
            [
              "Swift Target"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 112
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Rogue",
      "Info": [
        {
          "Description": "You are skilled and opportunistic, and you use your sharp wits to take advantage of your opponents’ missteps in order to strike where it hurts most. While the stereotypical rogue is a thief or scoundrel, plenty of rogues make respectable and honorable livings as bounty hunters, detectives, or scouts, and even sometimes as aristocrats, diplomats, or politicians. One thing you all share in common is the breadth and depth of your training in skills, easily outpacing your more martially or magically inclined comrades.",
          "Playing": "Players of rogue characters might approach gameplay in the following ways:\n• During combat, you move about stealthily so you can catch foes unawares. You’re a precision instrument, better used against a tough boss or distant spellcaster than against rank-and-file soldiers.\n• During social encounters, your skills give you multiple tools to influence your opposition. Pulling a con and ferreting information are second nature.\n• In exploration mode, you sneak to get the drop on foes or look for danger or traps. You’re a great asset since you can disable traps, solve puzzles, and anticipate dangers.\n• In downtime mode, you might pick pockets or trade in illegal goods. You can also become part of a thieves’ guild, or even found one of your own.",
          "Roleplaying": "Rogues are known for being swift, stealthy, and skilled.\n\nIF YOU’RE A ROGUE, YOU LIKELY...\n• Hone your skills through intense practice, both on your own and out in the world.\n• Know where to attain illicit goods.\n• Skirt or break the law because you think it’s meaningless or have your own code.\n\nOTHERS PROBABLY...\n• Think you’re motivated only by greed.\n• Find you charming or fascinating, even if they think they know better than to trust you.\n• Come to you when they need someone willing to take risks and break the law.",
          "Key Ability": [
            "Dexterity"
          ],
          "HP": 8,
          "Skills": 10,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Expert"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Hand Crossbow",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Rapier",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Sap",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Shortbow",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Shortsword",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Light Armor",
              "Type": "Armor",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Acrobatics",
            "Athletics",
            "Crafting",
            "Deception",
            "Diplomacy",
            "Intimidation",
            "Performance",
            "Society",
            "Stealth",
            "Thievery"
          ],
          "Advancement": [
            [
              "Finesse Striker",
              "Class Feat",
              "Skill Feat",
              "Sneak Attack",
              "Surprise Attack"
            ],
            [
              "Class Feat"
            ],
            [
              "Deny Advantage",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Sneak Attack",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Evasion",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Debilitating Strike",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Sneak Attack",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Improved Evasion",
              "Weapon tricks",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Double Debilitation",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Sneak Attack",
              "Slippery Mind",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ],
            [
              "Master Strike",
              "Skill Feat",
              "Skill Increase"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 118
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Sorcerer",
      "Info": [
        {
          "Description": "You didn’t choose to become a spellcaster—you were born one. There’s magic in your blood, whether divinity touched one of your ancestors, a forebear communed with a primal creature, or a powerful occult ritual has influenced your line. Regardless, self-reflection and study allow you to refine your inherent magical skills and continuously unlock new and more powerful abilities. The power in your blood carries a risk, however, and you constantly face the choice of whether you’ll rise to become a master spellcaster or fall into destruction.",
          "Playing": "Players of sorcerer characters might approach gameplay in the following ways:\n• During combat, you use your spells to strike down enemies by injuring them, influencing their minds, or hampering their movements. You’re probably too frail to get into melee combat, though your bloodline might give you abilities that let you hold your own in a brawl. Though you have powerful magic, sometimes you’ll need to resort to using your cantrips to conserve your best spells, or because you’ve used up your most powerful spells for the day.\n• During social encounters, your natural charisma means you’re good at interacting with people.\n• In exploration mode, you can detect magic that might be around you, finding treasures or warning your adventuring group of magical traps. When you come across mysteries or problems related to your bloodline, you can set yourself to solving them.\n• In downtime mode, you might craft magic items or scribe scrolls. Your bloodline might drive you to research your ancestry or to associate with people or creatures affiliated with your bloodline.",
          "Roleplaying": "Players may want to consider the following roleplaying suggestions for their sorcerer characters.\n\nIF YOU’RE A SORCERER, YOU LIKELY...\n• Have a strong independent streak, and while you may embrace or reject your magical heritage, you long to distinguish yourself as a spellcaster and individual in your own right.\n• View your lineage with a mix of fascination and fear—anything from wholehearted acceptance to vehement rejection.\n• Rely on magic items, such as scrolls and wands, to expand your limited selection of spells.\n\nOTHERS PROBABLY...\n• Marvel at your ability to create magic from thin air, and view your abilities with equal parts mistrust and admiration.\n• Consider you less dedicated than studious wizards, devoted clerics, and other practitioners of magic, since power comes to you naturally.\n• Assume you’re as unpredictable and chaotic as the magic you bring forth, even if your personality proves otherwise.",
          "Key Ability": [
            "Charisma"
          ],
          "HP": 6,
          "Skills": 5,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Simple Weapons",
              "Type": "Weapons",
              "Value": "Trained"
            },
            {
              "Name": "Armor",
              "Type": "Armor",
              "Value": "Untrained"
            },
            {
              "Name": "Bloodline Spelllist",
              "Type": "Spells",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Crafting",
            "Bloodline Skill"
          ],
          "Advancement": [
            [
              "Bloodline",
              "Bloodline Power",
              "Sorcerer Spellcasting",
              "Spell Repertoire"
            ],
            [
              "Class Feat"
            ],
            [
              "2nd-level Spells",
              "Spontaneous Heightening"
            ],
            [
              "Class Feat"
            ],
            [
              "3rd-level Spells"
            ],
            [
              "Advanced Bloodline Power"
            ],
            [
              "4th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "5th-level Spells"
            ],
            [
              "Greater Bloodline Power"
            ],
            [
              "6th-level Spells"
            ],
            [
              "Expert Spellcaster"
            ],
            [
              "7th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "8th-level Spells"
            ],
            [
              "Master Spellcaster"
            ],
            [
              "9th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Spellcaster"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 126
            }
          ]
        }
      ]
    },
    {
      "Type": "Class",
      "Name": "Wizard",
      "Info": [
        {
          "Description": "You are an eternal student of the arcane secrets of the universe. You treat magic like a science, cross-referencing the latest texts on practical spellcraft with ancient tomes of lost magic to discover and understand how magic works. Yet magical theory is vast, and there’s no way you can study it all. You either specialize in one of the eight schools of magic, gaining deeper understanding of the nuances of those spells above all others, or favor a broader approach emphasizing the way all magic comes together at the expense of depth.",
          "Playing": "Players of wizard characters might approach gameplay in the following ways:\n• During combat, you likely try to stay out of the fray, carefully judging when to use your spells. You save your most powerful spells to incapacitate threatening foes\nand use your renewable cantrips when only weaker foes remain, letting the martial characters dispatch them. When your enemies pull out nasty tricks like invisibility or flight, you answer them with spells like glitterdust or earth bind, leveling the playing field for your allies.\n• During social encounters, you provide a wellspring of knowledge and solve arguments using logic.\n• In exploration mode, you locate magical auras and determine the arcane significance of the various esoterica you uncover. When you run across an unusual obstacle to further exploration, you probably have a scroll somewhere that will make it easier to overcome.\n• In downtime mode, you learn new spells, train to make yourself more versatile for future situations, and research all sorts of information that will come in handy in your continuing adventures. You likely craft magic items or scribe scrolls for your party as well, which leads you to spend time seeking new and exciting formulas in addition to spells. You might even use downtime to forge scholarly connections and establish a school or guild of your own.",
          "Roleplaying": "Dedicated students of arcane magic, wizards are respected for their intellect, preparedness, and depth of knowledge, and feared for the otherworldly powers at their command.\n\nIF YOU’RE A WIZARD, YOU LIKELY...\n• Have an unquenchable intellectual curiosity about how everything in the world around you works—magic in particular.\n• Believe fervently in the superiority of your particular school of magic (if you’re a specialist) or in the fact that true mastery of magic requires knowledge of all schools (if you’re a universalist).\n• Use esoteric jargon and technical terms to precisely describe the minutiae of magical effects, even though the difference is probably lost on most other people. Getting it right matters to you.\n\nOTHERS PROBABLY...\n• Think you’re an arrogant snob who believes you’re smarter or better than others.\n• Fear what your magic can do to their minds, bodies, and souls and demand that you avoid casting spells in polite company, as few can identify whether one of your spells is harmless or malevolent until it’s too late.\n• Overestimate your capabilities, blaming you or giving you credit for things like the weather or crop yields, even if you don’t have magic that can affect those things, and asking you for spells or baubles that can help them get whatever they currently desire.",
          "Key Ability": [
            "Wisdom"
          ],
          "HP": 6,
          "Skills": 2,
          "Proficiencies": [
            {
              "Name": "Perception",
              "Type": "Sense",
              "Value": "Trained"
            },
            {
              "Name": "Fortitude",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Reflex",
              "Type": "Save",
              "Value": "Trained"
            },
            {
              "Name": "Will",
              "Type": "Save",
              "Value": "Expert"
            },
            {
              "Name": "Club",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Dagger",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Heavy Crossbow",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Light Crossbow",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Staff",
              "Type": "Weapon",
              "Value": "Trained"
            },
            {
              "Name": "Armor",
              "Type": "Armor",
              "Value": "Untrained"
            },
            {
              "Name": "Arcane",
              "Type": "Spells",
              "Value": "Trained"
            }
          ],
          "Signature Skills": [
            "Arcana",
            "Crafting"
          ],
          "Advancement": [
            [
              "Arcane Focus",
              "Arcane School",
              "Arcane Spellcasting",
              "Spellbook"
            ],
            [
              "Class Feat"
            ],
            [
              "2nd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "3rd-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "4th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "5th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "6th-level Spells"
            ],
            [
              "Expert Spellcaster"
            ],
            [
              "7th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "8th-level Spells"
            ],
            [
              "Master Spellcaster"
            ],
            [
              "9th-level Spells"
            ],
            [
              "Class Feat"
            ],
            [
              "Legendary Spellcaster"
            ],
            [
              "Class Feat"
            ]
          ],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 134
            }
          ]
        }
      ]
    }
  ],
  "Class Features": [
    {
      "Type": "Class Feature",
      "Name": "Advanced Alchemy",
      "Class": "Alchemist",
      "Info": {
        "Description": "You gain the Alchemical Crafting feat (see page 162), even if you don’t meet that feat’s prerequisites, and you gain the four additional common 1st-level alchemical formulas that feat grants. The list of alchemical items begins on page 360. You can use this feat to create common alchemical items as long as you have their formulas in your formula book, though their power is fleeting. You can create these items in two different ways, as described below. An alchemical item you create this way has the infused trait.\n  First, during your daily preparations (described on page 332), you can create items for which you have the formulas. Creating items in this way requires spending 1 Resonance Point to create a batch of alchemical items of that type with the infused trait. You select how many items are in the batch, up to half the normal maximum batch size (half a typical batch is two items, but see the Crafting Trained Activities section on page for more information). You don’t need to attempt a Crafting check to do this, and you ignore the number of days typically required to create the items and any requirements of alchemical reagents. You can’t overspend Resonance Points to create infused items in this way during your daily preparations. Second, you can create alchemical items with the Quick Alchemy action, described below.",
        "References": [],
        "Actions": [
          "Quick Alchemy"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 45
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Formula Book",
      "Class": "Alchemist",
      "Info": {
        "Description": "You start with a standard formula book worth 10 sp or less (as detailed on page 186) for free. The formula book contains formulas for your choice of 4 common 1st-level alchemical items. The list of alchemical items begins on page 360.\n  Each time you gain a new level, you can add formulas for two alchemical items to your formula book. These can be of any level of item you can create. You learn these formulas automatically, but it’s also possible to find or buy other formulas, or to invent them with the Inventor feat (see page 167).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 46
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Studied Resonance",
      "Class": "Alchemist",
      "Info": {
        "Description": "Knowledge, rather than personality, fuels your interactions with alchemical and magical substances and devices. Your maximum number of Resonance Points is equal to your character level plus your Intelligence modifier (instead of your Charisma modifier).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 46
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Empower Bombs",
      "Class": "Alchemist",
      "Info": {
        "Description": "When you craft an alchemical item with the bomb and infused traits—hereafter referred to in this entry as a bomb—you can empower it. You can empower only a 1st-level bomb, increasing its level and causing it to deal more damage. This also increases any persistent damage dealt by the bomb, but not its splash damage.\n• At 3rd level, you can create 3rd-level bombs that deal double the bomb’s base damage as presented in its entry. For instance, if you created a flask of 3rd-level empowered alchemist’s fire (see page 360), it would deal 2d6 fire damage, 2 persistent fire damage, and 1 splash damage on a hit.\n• At 7th level, you can create 7th-level bombs that deal three times the base damage.\n• At 11th level, you can create 11th-level bombs dealing four times the base damage.\n• At 15th level, you can create 15th-level bombs that deal five times the base damage, and attack rolls with your empowered bombs gain a +1 item bonus.\n• At 19th level, you can create 19th-level bombs that deal six times the base damage, and attack rolls with your empowered bombs gain a +2 item bonus.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 46
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Mutagen Crafting",
      "Class": "Alchemist",
      "Info": {
        "Description": "You learn the secret of mutagens. When you gain a new level and add new formulas to your book, you can select formulas for uncommon alchemical items with the mutagen trait.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 47
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expanded Resonance",
      "Class": "Alchemist",
      "Info": {
        "Description": "You gain a number of bonus Resonance Points equal to half your level. You can use these bonus Resonance Points only when using the Quick Alchemy action.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 47
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Double Elixir",
      "Class": "Alchemist",
      "Info": {
        "Description": "When using the Quick Alchemy action, instead of spending 1 Resonance Point to create a single item, you can spend up to 2 Resonance Points to make up to two alchemical items as described in that action. These items need not be the same.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 47
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Alchemical Alacrity",
      "Class": "Alchemist",
      "Info": {
        "Description": "When using the Quick Alchemy action, you can spend up to 3 Resonance Points to make up to three alchemical items as described in that action (1 per Resonance Point spent). These items need not be the same.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 47
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Rage",
      "Class": "Barbarian",
      "Info": {
        "Description": "Barbarians can fly into a dangerous battle rage. You gain the Rage action.",
        "References": [],
        "Actions": [
          "Rage"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 53
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Totem",
      "Class": "Barbarian",
      "Info": {
        "Description": "You associate your rage with a traditional symbol called a totem. Your totem gives you an ability, requires you to avoid certain behaviors, gives you resistances at higher levels, and allows you to select feats tied to your totem. For more information, see Totems on page 55.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 53
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Critical Brutality",
      "Class": "Barbarian",
      "Info": {
        "Description": "While you are raging, you gain access to the critical specialization effect for any melee weapon or unarmed attack you have (see page 183).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Deny Advantage",
      "Class": "Barbarian",
      "Info": {
        "Description": "You are not treated as flat-footed by creatures of your level or lower that are flanking you, though such creatures can still provide a flank to their allies. Also, you are no longer flat-footed against attacks from sensed or unseen creatures of your level or lower.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Juggernaut",
      "Class": "Barbarian",
      "Info": {
        "Description": "You become a master at Fortitude saves. When you succeed at a Fortitude save, treat it as a critical success.",
        "References": [],
        "Proficiency": [
          {
            "Name": "Fortitude",
            "Type": "Save",
            "Value": "Master"
          }
        ],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Raging Resistance",
      "Class": "Barbarian",
      "Info": {
        "Description": "You gain resistance equal to your Constitution modifier (minimum 0) to two damage types based on your totem.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Mighty Rage",
      "Class": "Barbarian",
      "Info": {
        "Description": "At 11th level, you gain the Mighty Rage free action.",
        "References": [],
        "Actions": [
          "Mighty Rage"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Improved Juggernaut",
      "Class": "Barbarian",
      "Info": {
        "Description": "You become legendary at Fortitude saves. When you critically fail a Fortitude save, treat it as a failure. When you fail a Fortitude save against an effect that deals damage, you halve the damage you take.",
        "References": [],
        "Actions": [],
        "Proficiency": [
          {
            "Name": "Fortitude",
            "Type": "Save",
            "Value": "Legendary"
          }
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Fury",
      "Class": "Barbarian",
      "Info": {
        "Description": "Your proficiency rank for simple weapons, martial weapons, and unarmed attacks increases to expert.",
        "Proficiency": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Martial Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Unarmed Attacks",
            "Type": "Weapons",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Indomitable Will",
      "Class": "Barbarian",
      "Info": {
        "Description": "Your rage fills your mind and heart with incredible strength, making it incredibly difficult to control you. You become a master at Will saves. When you succeed at a Will save, treat it as a critical success.",
        "Proficiency": [
          {
            "Name": "Will",
            "Type": "Save",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 54
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Tireless Rage",
      "Class": "Barbarian",
      "Info": {
        "Description": "You don’t become fatigued after you stop raging. It still takes the normal amount of time before you can use Rage again.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 55
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Devastating Strikes",
      "Class": "Barbarian",
      "Info": {
        "Description": "Your Strikes are so devastating that you hardly care about wielding the best weapon against each monster. If you succeed at a melee Strike against a creature with resistance against the physical damage type of the weapon or unarmed attack you’re using, reduce that resistance by twice your Constitution modifier (minimum 0).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 55
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Occult Spellcasting",
      "Class": "Bard",
      "Info": {
        "Description": "You have the power to cast occult spells using the Cast a Spell activity, and you gain access to the Material Casting, Somatic Casting, and Verbal Casting actions (see Casting Spells on page 195). Because you’re a bard, you can usually play an instrument as part of your Material Casting and Somatic Casting actions, so you usually don’t need spell components or another hand free. You can usually also play an instrument for your Verbal Casting actions rather than speaking. \n  Each day, you can cast up to two 1st-level spells. The number of spells you can cast each day are called your spell slots. You must know spells to cast them, and you learn them via the spell repertoire class feature. As you increase in level as a bard, your number of spells per day and the highest level of spells you can cast from spell slots increases, as shown on the Bard Spells per Day table on page 65.\n  Some of your spells require you to attempt a spell roll to see how effective they are, or have your enemies roll against your spell DC. Since your key ability is Charisma, your spell rolls and spell DCs use your Charisma modifier. See page 291 for details on calculating your spell rolls and spell DCs.\n\nHeightening Spells\nWhen you get spell slots of 2nd level and higher, you can heighten lowerlevel spells to higher levels. You must learn them at the new level to do so, as described on page 192. The spontaneous heightening class feature lets you select two spells you can heighten freely.\n\nCantrips\nSome of your spells are cantrips. A cantrip is a special type of spell that doesn’t use spell slots. You can cast a cantrip at will, any number of times per day. A cantrip is always automatically heightened to the highest level of spell you can cast as a bard. For example, as a 1st-level bard, the highest level of spell you can cast is 1st, so your cantrips are 1st-level spells. As a 5th-level bard, the highest level of spell you can cast is 3rd, so your cantrips are 3rd-level spells.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 63
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Spell Repertoire",
      "Class": "Bard",
      "Info": {
        "Description": "Spell Repertoire\nAt 1st level, you learn one 1st-level occult spell of your choice and four occult cantrips of your choice. You choose these from the common spells on the occult spell list in this book (see page 200) or from other occult spells to which you have access. You can cast any spell in your spell repertoire by using a spell slot of an appropriate spell level.\n  You add to this spell repertoire as you increase in level. Each time you get a spell slot from Table 3–6, you add a spell to your spell repertoire of the same level. So when you reach 2nd level, you select another 1st-level spell; at 3rd level, you select two 2nd-level spells, and at 4th level you select a 2nd-level spell.\n  Though you gain them at the same rate, your spell slots and spell repertoire are separate. If a feat or other ability adds a spell to your spell repertoire, it wouldn’t give you another spell slot, and vice versa.\n\nSwapping Spells in Your Repertoire\nAs you gain new spells in your repertoire, you might want to replace some of the spells you previously learned. Each time you level up and learn new spells, you can swap out one of your old spells for a different spell of the same level. This spell can be a cantrip. You can also swap out spells by retraining during downtime (see page 318).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 64
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "First Compositions",
      "Class": "Bard",
      "Info": {
        "Description": "Compositions are a special type of spell that require you to use the Performance skill as a part of their casting. At 1st level, bards gain two types of composition spells: composition cantrips and composition powers (which both have the composition trait). You gain the inspire courage composition cantrip (see page 233), which boosts your allies’ attacks, damage, and defense against fear. This is in addition to the cantrips you choose from the occult list. Feats can give you more composition cantrips. Unlike other cantrips, you can’t swap out compositions gained from bard feats at a later level, unless you swap out the specific feat via retraining (see page 318).\n  You can also cast a composition power called counter performance (see page 212) that protects against auditory and visual effects. You have a pool of Spell Points you can spend to cast this spell. Your maximum number of Spell Points is equal to your key ability modifier (minimum 0). You regain all your Spell Points during your daily preparations. You can cast counter performance only by spending 1 Spell Point, not using spell slots. This power is automatically heightened to the highest level of spell you can cast.\n  Some bard feats let you learn more composition powers, and such feats typically increase your pool of Spell Points.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 64
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Muses",
      "Class": "Bard",
      "Info": {
        "Description": "As a bard, you have a muse that leads you to great things, which might be a physical creature, a deity, a philosophy, or something more nebulous. While there are nearly as many different muses as there are bards, muses grant a limited number of different abilities to bards based on their theme.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 64
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Spontaneous Heightening",
      "Class": "Bard",
      "Info": {
        "Description": "You learn to freely heighten some of your spells, even if you know only the base version of the spell. During your daily preparations (see page 192), you can select up to two spells you know. You can cast those spells using any applicable higher-level spell slots you have, heightening the spell to the level of spell slot used, even if you don’t ordinarily know the spell at the higher level.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 65
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expert Spellcaster",
      "Class": "Bard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for occult spells increases to expert.",
        "Proficiencies": [
          {
            "Name": "Occult",
            "Type": "Spells",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 65
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Spellcaster",
      "Class": "Bard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for occult spells increases to master.",
        "Proficiencies": [
          {
            "Name": "Occult",
            "Type": "Spells",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 65
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Spellcaster",
      "Class": "Bard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for occult spells increases to legendary.",
        "Proficiencies": [
          {
            "Name": "Occult",
            "Type": "Spells",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 65
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Divine Spellcasting",
      "Class": "Cleric",
      "Info": {
        "Description": "You have the power to cast divine spells using the Cast a Spell activity, and you gain access to the Material Casting, Somatic Casting, and Verbal Casting actions (see Spellcasting on page 195). Because you’re a cleric, you can usually hold a divine focus (such as a religious symbol or a religious text) as part of your Material Casting and Somatic Casting actions, so you usually don’t need spell components or another hand free. At 1st level, you can prepare two 1st level spells and four cantrips each morning from the common spells on the divine spell list in this book (see page 200) or from other divine spells to which you gain access. Prepared spells remain available to you until you cast them or until you prepare your spells again. The number of spells you can prepare are called your spell slots.\n  As you increase in level as a cleric, the number of spells you can prepare each day increases, as does the highest level of spell you can cast, as shown on the Cleric Spells per Day table on page 70.\n  Some of your spells require you to attempt a spell roll to see how effective they are, or have your enemies roll against your spell DC. Since your key ability is Wisdom, your spell rolls and spell DCs use your Wisdom modifier. See page 291 for details on calculating your spell rolls and spell DCs.\n\nHeightening Spells\nWhen you get spell slots of 2nd level and higher, you can prepare lower-level spells in those slots to strengthen them. This increases the spell’s level to match the heightened spell slot. Many spells have specific improvements when they are heightened to certain levels (see page 192).\n\nCantrips\nA cantrip is a special type of spell that doesn’t use spell slots. You can cast a cantrip at will, any number of times per day. A cantrip is always automatically heightened to the highest level of spell you can cast as a cleric. For example, as a 1st-level cleric, the highest level of spell you can cast is 1st, so your cantrips are 1st-level spells. As a 5th-level cleric, the highest level of spell you can cast is 3rd, so your cantrips are 3rd-level spells.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 69
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Deity and Domain",
      "Class": "Cleric",
      "Info": {
        "Description": "Choose one deity you revere above all others. The most common deities in Pathfinder appear on Table 3–9: Deities on pages 72–73. This table lists each deity’s name, areas of concern, and alignment, followed by the benefits you get for being a cleric of that deity. Your alignment must be one allowed by your deity, as listed in parentheses after the deity’s alignment. Your deity grants you a signature skill and the trained proficiency rank with the deity’s favored weapon. If the favored weapon is uncommon, you also get access to that weapon. Your deity also adds spells to your spell list. When preparing spells, you can select from these in addition to the spells on the divine list once you can cast that level of spell.\n  Select one domain—a subject of particular interest to you within the traditions of your religion—from your deity’s list of domains. This domain grants you a special kind of spell called a domain power. Each domain’s theme and powers appear in Table 3–10: Domains on page 73. By choosing a domain, you gain a pool of Spell Points you can spend to cast domain powers. You can cast domain powers only by spending Spell Points, not by using spell slots. Your maximum number of Spell Points equals your key ability modifier (minimum 0). You regain all your Spell Points when you prepare your spells. You gain the initial power tied to your domain when you select the domain. Your initial domain power costs 1 Spell Point to cast and is automatically heightened to the highest level of spell you can cast. Domain powers are available only to characters who’ve selected the domain and can’t be learned by others.\n  Some cleric feats grant you more domain powers, and such feats typically increase your pool of Spell Points. You can learn additional powers, called advanced domain powers, by taking the Advanced Domain cleric feat. The Spell Point cost of this advanced domain power is listed in parentheses after its name in Table 3–10: Domains.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 70
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Anathema",
      "Class": "Cleric",
      "Info": {
        "Description": "Actions fundamentally opposed to your deity’s alignment or ideals are anathema to your faith. Committing acts, learning or casting spells, and using items that are anathema to your deity take you out of that deity’s good graces.\n  Casting spells with the evil trait is almost always anathema to good deities, and casting good spells is likewise anathema to evil deities; similarly, casting chaotic spells is anathema to lawful deities and casting lawful spells is anathema to chaotic deities. A neutral cleric who worships a neutral deity isn’t limited this way, but their alignment might change over time if they frequently cast spells or use abilities with a certain alignment. Similarly, casting spells that are anathema to the tenets or goals of your faith could interfere with your connection to your deity. For example, casting a spell to enhance your ability to lie would be anathema to Sarenrae, as a goddess of honesty, and casting one to create undead would be anathema to Pharasma, the goddess of death.\n  For borderline cases, you and your GM determine whether other acts count as anathema. For example, Torag is a god of community, so actions that work to destroy a close-knit community are typically anathema to Torag. However, as god of dwarves, he might permit you to destroy a community of giants that is threatening to wipe out a dwarven settlement.\n  If you perform enough acts that are anathema to your deity or if your alignment changes to one not allowed by your deity, you lose the magical abilities that come from your connection to your deity. The class features that you lose are determined by the GM, but they likely include channel energy, domain powers, and divine spellcasting. These abilities can be regained only if you demonstrate your repentance by conducting an atone ritual (see page 275).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 70
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Channel Energy",
      "Class": "Cleric",
      "Info": {
        "Description": "You gain a pool of positive or negative energy, depending on your deity, as shown on Table 3–9: Deities on pages 72–73. Some deities allow you to choose whether to channel negative or positive energy. Once you choose, you can’t change the type of energy you channel, short of an ethical shift or divine intervention.\n  This pool of energy allows you to cast either the heal spell (for positive energy) or the harm spell (for negative energy) a number of times per day equal to 3 plus your Charisma modifier without needing to prepare the spell in advance. All spells you cast in this way are heightened to the maximum spell level you can cast as a cleric. You can find heal on page 229 and harm on page 228.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 71
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expert Spellcaster",
      "Class": "Cleric",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for divine spells increases to expert.",
        "Proficiencies": [
          {
            "Name": "Divine",
            "Type": "Spells",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 71
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Spellcaster",
      "Class": "Cleric",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for divine spells increases to master.",
        "Proficiencies": [
          {
            "Name": "Divine",
            "Type": "Spells",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 71
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Spellcaster",
      "Class": "Cleric",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for divine spells increases to Legendary.",
        "Proficiencies": [
          {
            "Name": "Divine",
            "Type": "Spells",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 71
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Primal Spellcasting",
      "Class": "Druid",
      "Info": {
        "Description": "You have the power to cast primal spells using the Cast a Spell activity, and you gain access to the Material Casting, Somatic Casting, and Verbal Casting actions (see Casting Spells on page 195). Because you’re a druid, you can usually hold a primal focus (such as holly and mistletoe) as part of your Material Casting and Somatic Casting actions, so you usually don’t need spell components or another hand free. At 1st level, you can prepare two 1st-level spells and four cantrips each\nmorning from the common spells on the primal spell list in this book (see page 201), or from other primal spells to which you gain access. Prepared spells remain available to you until you cast them or until you prepare your spells again. The number of spells you can prepare are called your spell slots.\n  As you increase in level as a druid, the number of spells you can prepare each day increases, as does the highest level of spell you can cast, as shown on the Druid Spells per Day table on page 81.\n  Some of your spells require you to attempt a spell roll to see how effective they are, or have your enemies roll against your spell DC. Since your key ability is Wisdom, your spell rolls and spell DCs use your Wisdom modifier. See page 291 for details on calculating your spell rolls and spell DCs.\n\nHeightening Spells\nWhen you get spell slots of 2nd level and higher, you can prepare lower-level spells in those slots to strengthen them. This increases the spell’s level to match the heightened spell slot. Many spells have specific improvements when they are heightened to certain levels (see page 192).\n\nCantrips\nA cantrip is a special type of spell that doesn’t use spell slots. You can cast a cantrip at will, any number of times per day. A cantrip is always automatically heightened to the highest level of spell you can cast as a druid. For example, as a 1st-level druid, the highest level of spell you can cast is 1st, so your cantrips are 1st-level spells. As a 5th-level druid, the highest level of spell you can cast is 3rd, so your cantrips are 3rd-level spells.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 80
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Anathema",
      "Class": "Druid",
      "Info": {
        "Description": "As stewards of the natural order, druids find affronts to nature anathema. If you perform enough acts that are anathema to nature, you lose your magical abilities that come from the druid class, including your primal spellcasting and the benefits of your order. These abilities can be regained only if you demonstrate your repentance by conducting an atone ritual (see page 275).\n The following acts are anathema to all druids:\n• Using metal armor or shields.\n• Despoiling natural places.\n• Teaching the Druidic language to nondruids.\n Each druidic order also has additional anathema acts.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 80
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Druidic Order",
      "Class": "Druid",
      "Info": {
        "Description": "Upon becoming a druid, you align yourself with a druidic order, which grants you a class feat, an order power (see below), and an additional signature skill tied to your order. Though you can still gain class feats tied to other orders as you advance, you receive additional benefits when using abilities tied to your chosen order.\n  You gain a pool of Spell Points. Your maximum number of Spell Points is equal to your key ability modifier. You regain all your Spell Points when you prepare your spells (see Daily Preparations on page 192).\n  You also gain a special spell tied to your order, which is called an order power. You cast this order power by spending 1 Spell Point, not by using spell slots. Your order power is automatically heightened to the highest level of spell you can cast. Some druid feats grant you more order powers and increase your pool of Spell Points.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 80
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Druidic Language",
      "Class": "Druid",
      "Info": {
        "Description": "You know Druidic, a secret language known only to druids, in addition to any languages you know through your ancestry. Druidic has its own alphabet. If you use sign languages instead of spoken languages, you know the sign language version of Druidic. Teaching the Druidic language to nondruids is anathema (see page 80).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 81
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Wild Empathy",
      "Class": "Druid",
      "Info": {
        "Description": "You have a connection to the creatures of the natural world that allows you to communicate with them on a rudimentary level. You can use Diplomacy to Make an Impression on animals and to make very simple Requests of them.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 81
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expert Spellcaster",
      "Class": "Druid",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for primal spells increases to expert.",
        "Proficiencies": [
          {
            "Name": "Primal",
            "Type": "Spells",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 81
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Spellcaster",
      "Class": "Druid",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for primal spells increases to Master.",
        "Proficiencies": [
          {
            "Name": "Primal",
            "Type": "Spells",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 81
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Spellcaster",
      "Class": "Druid",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for primal spells increases to Legendary.",
        "Proficiencies": [
          {
            "Name": "Primal",
            "Type": "Spells",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 81
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Attack of Opportunity",
      "Class": "Fighter",
      "Info": {
        "Description": "You gain the Attack of Opportunity reaction.",
        "References": [],
        "Actions": [
          "Attack of Opportunity"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 87
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Mastery",
      "Class": "Fighter",
      "Info": {
        "Description": "Choose one weapon group. Your proficiency rank increases to master with the simple and martial weapons in that group and to expert with the exotic weapons in that group. You gain access to the critical specialization effects of all simple and martial weapons in that group (see page 183).",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Exotic Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Bravery",
      "Class": "Fighter",
      "Info": {
        "Description": "When you succeed at a Will save against a fear effect, treat it as a critical success instead. If you critically succeed at a save against a fear effect, you gain a +2 circumstance bonus to saves against fear effects for 1 minute.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Battlefield Surveyor",
      "Class": "Fighter",
      "Info": {
        "Description": "You become a master in Perception. In addition, you add a +1 circumstance bonus to Perception checks for initiative, making you faster to react during combat.",
        "Proficiencies": [
          {
            "Name": "Perception",
            "Type": "Sense",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Combat Flexibility",
      "Class": "Fighter",
      "Info": {
        "Description": "When you make your daily preparations, you gain one fighter feat of 8th level or lower that you don’t have. You can use that feat until your next daily preparations. You must meet all its other prerequisites.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Heavy Armor Expertise",
      "Class": "Fighter",
      "Info": {
        "Description": "Your proficiency rank for heavy armor and all shields increases to expert.",
        "Proficiencies": [
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Expert"
          },
          {
            "Name": "Shields",
            "Type": "Shields",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Specialization",
      "Class": "Fighter",
      "Info": {
        "Description": "Your proficiency rank for all simple and martial weapons increases to master, and you gain access to the critical specialization effects of all weapon groups (see page 183). Your proficiency rank for all exotic weapons increases to expert.\n  You can choose one weapon group and increase your proficiency rank to legendary for all simple and martial weapons in that weapon group, and to master for all exotic weapons in that weapon group. You gain the critical specialization effects of all weapons in that weapon group.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Martial Weapons",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Exotic Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Legendary"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Legendary"
          },
          {
            "Name": "Exotic Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Armor Mastery",
      "Class": "Fighter",
      "Info": {
        "Description": "Your proficiency rank for heavy armor and shields increases to master. Reduce your Speed penalty for wearing heavy armor from 10 feet to 5 feet. Your proficiency rank for medium armor increases to expert.",
        "Proficiencies": [
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Master"
          },
          {
            "Name": "Shields",
            "Type": "Shields",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Legend",
      "Class": "Fighter",
      "Info": {
        "Description": "Your proficiency rank for all simple and martial weapons and unarmed attacks increases to legendary, and your proficiency rank for all exotic weapons increases to master. You gain access to the critical specialization effects of all weapon groups.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Legendary"
          },
          {
            "Name": "Martial Weapons",
            "Type": "Weapons",
            "Value": "Legendary"
          },
          {
            "Name": "Exotic Weapons",
            "Type": "Weapons",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 88
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Flurry of Blows",
      "Class": "Monk",
      "Info": {
        "Description": "You can attack rapidly with your fists. You gain the Flurry of Blows action.",
        "References": [],
        "Actions": [
          "Flurry of Blows"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 97
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Graceful Expertise",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmored defense proficiency rank is expert.",
        "Proficiencies": [
          {
            "Name": "Unarmored",
            "Type": "Armor",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 97
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Powerful Fist",
      "Class": "Monk",
      "Info": {
        "Description": "When striking with your fist, you deal 1d6 damage instead of 1d4. You use your normal proficiency when making a lethal attack with a nonlethal unarmed attack.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 97
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Incredible Movement",
      "Class": "Monk",
      "Info": {
        "Description": "You gain a +10-foot conditional bonus to your Speed whenever you’re not wearing armor. The bonus increases by 5 feet for every 3 monk levels you have beyond 3rd.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Magic Strikes",
      "Class": "Monk",
      "Info": {
        "Description": "Your proficiency rank for unarmed attacks increases to expert. Your unarmed attacks become magical, allowing them to bypass resistances accordingly. You still need an item such as handwraps of mighty fists to gain a bonus to attack rolls or increase your attacks’ weapon damage dice.",
        "Proficiencies": [
          {
            "Name": "Unarmed Attacks",
            "Type": "Weapons",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Metal Strikes",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmed attacks are treated as cold iron and silver.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Path to Perfection",
      "Class": "Monk",
      "Info": {
        "Description": "Choose your Fortitude, Reflex, or Will saving throw. Your proficiency rank in the chosen saving throw increases to master.",
        "Proficiencies": [
          {
            "Name": "Saving Throw",
            "Type": "Save",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Fierce Flurry",
      "Class": "Monk",
      "Info": {
        "Description": "If you hit with both Strikes in a Flurry of Blows, increase the weapon damage dice of each attack by one step.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Second Path to Perfection",
      "Class": "Monk",
      "Info": {
        "Description": "If you succeed at a saving throw in which your proficiency rank is master, you instead critically succeed.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Graceful Mastery",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmored defense proficiency rank becomes master.",
        "Proficiencies": [
          {
            "Name": "Unarmored",
            "Type": "Armor",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Unarmed Mastery",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmed attack proficiency rank becomes master.",
        "Proficiencies": [
          {
            "Name": "Unarmed Attacks",
            "Type": "Weapons",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Third Path to Perfection",
      "Class": "Monk",
      "Info": {
        "Description": "Choose your Fortitude, Reflex, or Will saving throw. If your proficiency rank for the chosen type of save is master, it increases to legendary; otherwise, it increases to master.",
        "Proficiencies": [
          {
            "Name": "Save",
            "Type": "Save",
            "Value": "+1"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Adamantine Strikes",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmed attacks are treated as adamantine.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Graceful Legend",
      "Class": "Monk",
      "Info": {
        "Description": "Your unarmored defense proficiency becomes legendary.",
        "Proficiencies": [
          {
            "Name": "Unarmored",
            "Type": "Armor",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Perfected Form",
      "Class": "Monk",
      "Info": {
        "Description": "When you make an unarmed Strike, you can treat any dice whose roll was lower than 10 as if you had rolled a 10. If you do, your Strike gains the fortune trait.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 98
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Code of Conduct",
      "Class": "Paladin",
      "Info": {
        "Description": "Code of Conduct\nPaladins are divine champions of a deity. You must be lawful good and worship a deity that allows lawful good clerics. See the list of deities on page 72.\n  Actions fundamentally opposed to your deity’s alignment or ideals are anathema to your faith. A few examples of acts that would be considered anathema appear in each deity’s entry. You and your GM will determine whether other acts count as anathema.\n  In addition, you must follow the paladin’s code below. Deities often add additional strictures for their own paladins (for instance, Shelyn’s paladins never attack first except to protect an innocent, and they choose and perfect an art form). \n  If you stray from lawful good, perform acts anathema to your deity, or violate your code of conduct, you lose your Spell Point pool and righteous ally until you demonstrate your repentance by conducting an atone ritual (see page 275), but keep any other paladin abilities that don’t require those class features.\n\nThe Paladin’s Code\nThe following is the fundamental code all paladins follow. The tenets are listed in order of importance, starting with the most important. If a situation places two tenets in conflict, you aren’t in a no-win situation; instead, follow the most important tenet. For instance, if an evil king asked you if innocent lawbreakers were hiding in your church so he could execute them, you could lie to him, since the tenet forbidding you to lie is less important than the tenet prohibiting the harm of an innocent. An attempt to subvert the paladin code by engineering a situation allowing you to use a higher tenet to ignore a lower tenet (telling someone that you won’t respect lawful authorities so that the tenet of not lying supersedes the tenet of respecting lawful authorities, for example) is a violation of the paladin code.\n• You must never willingly commit an evil act, such as murder, torture, or the casting an evil spell.\n• You must not use actions that you know will harm an innocent, or through inaction cause an innocent immediate harm when you knew your action could reasonably prevent it. This tenet doesn’t force you to take action against possible harm to innocents or to sacrifice your life and potential to attempt to protect an innocent.\n• You must act with honor, never cheating, lying, or taking advantage of others.\n• You must respect the lawful authority of the legitimate ruler or leadership in whichever land you may be, following their laws unless they violate a higher tenet.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 105
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Deific Weapon",
      "Class": "Paladin",
      "Info": {
        "Description": "If your deity’s favored weapon (see page 72) is uncommon, you gain access to it. If the weapon is simple, increase the damage die by one step when you wield it (d4 to d6, d6 to d8, d8 to d10, d10 to d12).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 106
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Retributive Strike",
      "Class": "Paladin",
      "Info": {
        "Description": "As a paladin, you are a stalwart protector of those under your charge. You gain the Retributive Strike reaction.",
        "References": [],
        "Actions": [
          "Retributive Strike"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 106
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Champion Powers",
      "Class": "Paladin",
      "Info": {
        "Description": "Divine power flows through you, and you have learned to channel it to heal others. This grants you special spells\n alled champion powers. You gain a pool of Spell Points you can spend to cast champion powers. Your maximum number of Spell Points is equal to your Charisma modifier (minimum 0). You regain all your Spell Points when you prepare each day. Your key spellcasting ability score is Charisma, and you’re trained in spell rolls and spell DCs for your champion powers. Your champion powers are divine spells.\n  Champion powers are available only to paladins, and they can’t be learned by other characters. They appear in the Spells chapter (page 192). Some paladin feats grant you additional champion powers, and such feats typically increase your pool of Spell Points. The spell level of each of your champion powers is equal to half your character level, rounded down, and produces heightened effects (see page 192) for those champion powers that have heightened entries.\n  You gain the ability to cast the lay on hands champion power by spending 1 Spell Point.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 106
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Righteous Ally",
      "Class": "Paladin",
      "Info": {
        "Description": "Your devotion to the cause of good attracts the attention of a holy spirit to aid you on your journey. This spirit can take many forms, each granting you abilities and advantages. Once you have chosen the ally’s form, it cannot be changed.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 106
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Expertise",
      "Class": "Paladin",
      "Info": {
        "Description": "Select a specific weapon group. Your proficiency rank for simple and martial weapons in that group increases to expert.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Armored Fortitude",
      "Class": "Paladin",
      "Info": {
        "Description": "Your proficiency rank for heavy armor and shields increases to expert, and your proficiency rank for Fortitude saves increases to master. While wearing heavy armor, when you succeed at a Fortitude save, treat your result as a critical success instead.",
        "Proficiencies": [
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Expert"
          },
          {
            "Name": "Shields",
            "Type": "Shields",
            "Value": "Expert"
          },
          {
            "Name": "Fortitude",
            "Type": "Save",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Holy Smite",
      "Class": "Paladin",
      "Info": {
        "Description": "Your Retributive Strike surrounds evil targets in a righteous aura that punishes their transgressions. The target of a successful Retributive Strike takes persistent good damage equal to your Charisma modifier.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Aura of Justice",
      "Class": "Paladin",
      "Info": {
        "Description": "When you use the Retributive Strike reaction, you can increase the penalty on your attack to –5. If you do so, whether or not your attack is a success, all allies within 10 feet of you who can reach the target can also spend a reaction to make a normal Retributive Strike against the target. These additional attacks do not cause the target to become enfeebled.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Armor Mastery",
      "Class": "Paladin",
      "Info": {
        "Description": "Your proficiency rank for heavy armor and shields increases to master, and your proficiency rank for light and medium armor increases to expert. Reduce the penalty to movement due to heavy armor from 10 feet to 5 feet.",
        "Proficiencies": [
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Expert"
          },
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Expert"
          },
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Master"
          },
          {
            "Name": "Shields",
            "Type": "Shields",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Mastery",
      "Class": "Paladin",
      "Info": {
        "Description": "Your proficiency rank for simple and martial weapons in your chosen weapon group increases to master, and your proficiency rank for all other simple and martial weapons increases to expert.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Martial Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Armor",
      "Class": "Paladin",
      "Info": {
        "Description": "Your proficiency rank for heavy armor and shields increases to legendary, and your proficiency rank for light and medium armor increases to master. Reduce the check penalty from armor and shields by 1.",
        "Proficiencies": [
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Master"
          },
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Master"
          },
          {
            "Name": "Heavy Armor",
            "Type": "Armor",
            "Value": "Legendary"
          },
          {
            "Name": "Shields",
            "Type": "Shields",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Hero's Defiance",
      "Class": "Paladin",
      "Info": {
        "Description": "You gain the power to defy fate and continue fighting as long as you have divine energy. You gain the hero’s defiance champion power, which you can cast by spending 2 Spell Points. Increase your Spell Point pool by 2.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 107
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Hunt Target",
      "Class": "Ranger",
      "Info": {
        "Description": "You gain the Hunt Target action, granting you an advantage against a foe.",
        "References": [],
        "Actions": [
          "Hunt Target"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 113
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Expertise",
      "Class": "Ranger",
      "Info": {
        "Description": "Choose a single weapon group. Your proficiency rank increases to expert for the simple and martial weapons of that group. You gain access to the critical specialization effects of all simple and martial weapons in that group.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Trackless Step",
      "Class": "Ranger",
      "Info": {
        "Description": "When you move through natural terrains, you are difficult to track. You always gain the benefits of the Cover Tracks action in such terrains, without moving at half your Speed.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Evasion",
      "Class": "Ranger",
      "Info": {
        "Description": "Your senses and reflexes are honed to a razor’s edge, allowing you to leap out harm’s way. You gain master proficiency in Reflex saves and Perception. When you succeed at a Reflex save, treat the outcome as a critical success instead.",
        "Proficiencies": [
          {
            "Name": "Reflex",
            "Type": "Save",
            "Value": "Master"
          },
          {
            "Name": "Perception",
            "Type": "Sense",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Nature's Edge",
      "Class": "Ranger",
      "Info": {
        "Description": "You treat enemies in areas of natural difficult terrain, or in difficult terrain resulting from a snare, as flat-footed.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Wild Stride",
      "Class": "Ranger",
      "Info": {
        "Description": "You can ignore the effects of nonmagical difficult terrain and reduce the effects of nonmagical greater difficult terrain, treating it as if it were difficult terrain instead. Difficult terrain or greater difficult terrain effects of hazardous terrain affect you normally.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Mastery",
      "Class": "Ranger",
      "Info": {
        "Description": "Your proficiency rank for simple and martial weapons in your chosen weapon group increases to master, and your proficiency rank for all other simple and martial weapons increases to expert. You gain access to the critical specialization effects of all simple and martial weapons.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Martial Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Simple Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          },
          {
            "Name": "Martial Weapons",
            "Subname": "Weapon group",
            "Type": "Weapons",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Improved Evasion",
      "Class": "Ranger",
      "Info": {
        "Description": "You become legendary at Reflex saves and Perception. When you critically fail a Reflex save, treat the outcome as a failure instead. When you fail a Reflex save against an effect that deals damage, you take only half damage.",
        "Proficiencies": [
          {
            "Name": "Reflex",
            "Type": "Save",
            "Value": "Legendary"
          },
          {
            "Name": "Perception",
            "Type": "Sense",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Masterful Hunter",
      "Class": "Ranger",
      "Info": {
        "Description": "You can blend your weapon mastery with skillful targeting to make a series of accurate attacks. If you are a master with your weapon, as long as all your weapon attacks in a round are against the target you’re hunting, the multiple attack penalty you take on the second attack is –3 (–2 with an agile weapon) instead of –5, and –6 (–4 with an agile weapon) instead of –10 on the third and any further attacks.\n  If you are a master with your weapon, you can ignore the penalty against the target of your hunt for attacking within its second and third range increments.\n  If you’re a master in Perception, you gain a +4 circumstance bonus to Perception checks when you Seek your target, and if you’re a master in Survival, you gain a +4 circumstance bonus to Survival checks when you Track your target.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Swift Target",
      "Class": "Ranger",
      "Info": {
        "Description": "You can use Hunt Target as a free action triggered before you make your first Strike each round.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 114
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Finesse Striker",
      "Class": "Rogue",
      "Info": {
        "Description": "When you attack with an agile or finesse one-handed melee weapon, you can add your Dexterity modifier to damage instead of your Strength modifier.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 119
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Sneak Attack",
      "Class": "Rogue",
      "Info": {
        "Description": "You deal additional damage to flat-footed creatures (see page 322). If you Strike a flat-footed creature with an agile or finesse melee weapon, an agile or finesse unarmed attack, or a ranged attack, you deal 1d6 extra precision damage. For a ranged attack with a thrown weapon, that weapon must also be agile or finesse.\n  As your rogue levels increase, so does the number of damage dice of your sneak attack. Increase the number of dice by one at 5th, 11th, and 17th levels.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 119
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Surprise Attack",
      "Class": "Rogue",
      "Info": {
        "Description": "On the first round of combat, creatures that haven’t acted are flat-footed to you.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 119
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Deny Advantage",
      "Class": "Rogue",
      "Info": {
        "Description": "You aren’t flat-footed to sensed, unseen, or flanking creatures of your level or lower; they can still provide allies a flank.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Evasion",
      "Class": "Rogue",
      "Info": {
        "Description": "Your proficiency rank for Reflex saves and Perception increases to master. When you succeed at a Reflex save, treat the outcome as a critical success.",
        "Proficiencies": [
          {
            "Name": "Reflex",
            "Type": "Save",
            "Value": "Master"
          },
          {
            "Name": "Perception",
            "Type": "Sense",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Debilitating Strike",
      "Class": "Rogue",
      "Info": {
        "Description": "You gain the Debilitating Strike free action.",
        "References": [],
        "Actions": [
          "Debilitating Strike"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Improved Evasion",
      "Class": "Rogue",
      "Info": {
        "Description": "Your proficiency rank for Reflex saves and Perception increases to legendary. When you critically fail a Reflex save, treat the outcome as a failure. When you fail a Reflex save against a damaging effect, you take half damage.",
        "Proficiencies": [
          {
            "Name": "Reflex",
            "Type": "Save",
            "Value": "Legendary"
          },
          {
            "Name": "Perception",
            "Type": "Sense",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Weapon Tricks",
      "Class": "Rogue",
      "Info": {
        "Description": "You become an expert in all simple weapons plus the hand crossbow, rapier, sap, shortbow, and shortsword.",
        "Proficiencies": [
          {
            "Name": "Simple Weapons",
            "Type": "Weapons",
            "Value": "Expert"
          },
          {
            "Name": "Hand Crossbow",
            "Type": "Weapon",
            "Value": "Expert"
          },
          {
            "Name": "Rapier",
            "Type": "Weapon",
            "Value": "Expert"
          },
          {
            "Name": "Sap",
            "Type": "Weapon",
            "Value": "Expert"
          },
          {
            "Name": "Shortbow",
            "Type": "Weapon",
            "Value": "Expert"
          },
          {
            "Name": "Shortsword",
            "Type": "Weapon",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Double Debilitation",
      "Class": "Rogue",
      "Info": {
        "Description": "When you use Debilitating Strike, you can apply two debilitations simultaneously; removing one removes both.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Slippery Mind",
      "Class": "Rogue",
      "Info": {
        "Description": "You become a master at Will saves. When you succeed at a Will save, treat the outcome as a critical success instead.",
        "Proficiencies": [
          {
            "Name": "Will",
            "Type": "Save",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Strike",
      "Class": "Rogue",
      "Info": {
        "Description": "You gain the Master Strike free action.",
        "References": [],
        "Actions": [
          "Master Strike"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 120
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Bloodline",
      "Class": "Sorcerer",
      "Info": {
        "Description": "You choose one bloodline to represent the magical ancestry that gives you your spellcasting talent. This choice determines the type of spells you cast, the spell list from which you choose your spells, additional spells you learn, and additional signature skills you gain. You also gain Spell Points and special powers based on your bloodline. See Bloodlines on pages 129–130, and Casting Spells on pages 195–196.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 127
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Sorcerer Spellcasting",
      "Class": "Sorcerer",
      "Info": {
        "Description": "You have the power to cast spells using the Cast a Spell activity, and you gain access to the Material Casting, Somatic Casting, and Verbal Casting actions (see Casting Spells on pages 195–196). Because you’re a sorcerer, you can usually replace Material Casting actions with Somatic Casting actions, so you usually don’t need spell components.\n  Each day, you can cast up to two 1st-level spells, plus an extra 1st-level spell due to the power of your bloodline. The number of spells you can cast each day are called your spell slots. You must know spells to cast them, and you learn them via the spell repertoire class feature. As you increase in level as a sorcerer, your number of spells per day and the highest level of spells you can cast from spell slots increases, as shown on the Sorcerer Spells per Day table on page 129.\n  Some of your spells require you to attempt a spell roll to see how effective they are, or have your enemies roll against your spell DC. Since your key ability is Charisma, your spell rolls and spell DCs use your Charisma modifier. See page 291 for details on calculating your spell rolls and spell DCs.\n\nHeightening Spells\nWhen you get spell slots of 2nd level and higher, you can heighten lower-level spells to higher levels. You must learn them at the new level to do so, as described on page 192. The spontaneous heightening class feature lets you select two spells you can heighten freely.\n\nCantrips\nSome of your spells are cantrips. A cantrip is a special type of spell that doesn’t use spell slots. You can cast a cantrip at will, any number of times per day. A cantrip is always automatically heightened to the highest level of spell you can cast as a sorcerer. For example, as a 1stlevel sorcerer, the highest level of spell you can cast is 1st, so your cantrips are 1st-level spells. As a 5th-level sorcerer, the highest level of spell you can cast is 3rd, so your cantrips are 3rd-level spells.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 128
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Spell Repertoire",
      "Class": "Sorcerer",
      "Info": {
        "Description": "At 1st level, you learn two 1st-level spells of your choice and four cantrips of your choice, as well as an additional spell and cantrip from your bloodline (see page 130). You choose these from the common spells on the spell list corresponding to your bloodline in this book, or from other spells on that spell list to which you gain access. You can cast any spell in your spell repertoire by using a spell slot of an appropriate spell level.\n  You add to this spell repertoire as you increase in level. Each time you get a spell slot from Table 3–20, you add a spell to your spell repertoire of the same level. So when you reach 2nd level, you select another 1st-level spell; at 3rd level, you select two 2nd-level spells, and at 4th level you select a 2nd-level spell. Each time you learn spells of a new spell level, your bloodline also grants you both a new spell and a new spell slot of that level. As with other spell slots, you can use this bonus slot to cast any spell, not just the one your bloodline gave you.\n  Though you gain them at the same rate, your spell slots and spell repertoire are separate. If a feat or other ability adds a spell to your spell repertoire, it wouldn’t give you another spell slot, and vice versa.\n\nSwapping Spells in Your Repertoire\nAs you gain new spells in your repertoire, you might want to replace some of the spells you previously learned. Each time you level up and learn new spells, you can swap out one of your old spells for a different spell of the same level. This spell can be a cantrip. You can also swap out spells by retraining during downtime (see page 318).",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 128
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Spontaneous Heightening",
      "Class": "Sorcerer",
      "Info": {
        "Description": "You learn to freely heighten some of your spells, even if you know only the base version of the spell. During your daily preparations (see page 192), you can pick up to two spells you know. You can cast those spells using any applicable higher-level spell slots you may have, heightening the spell to the level of spell slot used, even if you don’t ordinarily know the spell at the higher level.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 129
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expert Spellcaster",
      "Class": "Sorcerer",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for your bloodline’s type of spells increases to expert.",
        "Proficiencies": [
          {
            "Name": "Bloodline",
            "Type": "Spells",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 129
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Spellcaster",
      "Class": "Sorcerer",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for your bloodline’s type of spells increases to master.",
        "Proficiencies": [
          {
            "Name": "Bloodline",
            "Type": "Spells",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 129
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Spellcaster",
      "Class": "Sorcerer",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for your bloodline’s type of spells increases to legendary.",
        "Proficiencies": [
          {
            "Name": "Bloodline",
            "Type": "Spells",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 129
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Arcane Spellcasting",
      "Class": "Wizard",
      "Info": {
        "Description": "You have the power to cast arcane spells using the Cast a Spell activity, and gain access to the Material Casting, Somatic Casting, and Verbal Casting actions (see Casting Spells on page 195). At 1st level you can prepare up to two 1st-level spells and four cantrips each morning from the spells in your spellbook (see page 137), plus one extra cantrip and spell of your chosen school of each level you can cast if you are a specialist wizard. Prepared spells remain available to you until you cast them or until you prepare your spells again. The number of spells you can prepare are called your spell slots.\n  As you increase in level as a wizard, your number of spell slots and the highest level of spells you can cast from spell slots increase, as shown on the Wizard Spells per Day table on page 137.\n  Some of your spells require you to attempt a spell roll to see how effective they are, or have your enemies roll against your spell DC. Since your key ability is Intelligence, your spell rolls and spell DCs use your Intelligence modifier. See page 291 for details on calculating your spell rolls and spell DCs.\n\nHeightening Spells\nWhen you get spell slots of 2nd level and higher, you can prepare lower-level spells in those slots to strengthen them (see page 192). This increases the spell’s level to match the heightened spell slot. Many spells have specific improvements when they are heightened to certain levels.\n\nCantrips\nA cantrip is a special type of spell that doesn’t use spell slots. You can cast a cantrip at will, any number of times per day. A cantrip is always automatically heightened to the highest level of spell you can cast as a wizard. For example, as a 1st-level wizard, the highest level of spell you can cast is 1st, so your cantrips are 1st-level spells. As a 5th-level wizard, the highest level of spell you can cast is 3rd, so your cantrips are 3rd-level spells.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 135
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Spellbook",
      "Class": "Wizard",
      "Info": {
        "Description": "You start with a spellbook worth 10 sp or less (as detailed on page 187), which you receive for free. The spellbook contains your choice of 10 arcane cantrips and eight 1st-level\narcane spells. You choose these from the common spells on the arcane spell list from this book (see page 199) or from other arcane spells you gain access to. \n  Each time you gain a level, you automatically add two more arcane spells to your spellbook. These can be of any level of spell you can cast. You can also use the Arcana skill to add other spells that you find, as described on page 146.\n  If you’re creating a higher-level character, it’s usually easiest to assume you always picked new spells of the highest level possible. At an odd-numbered level, this means that in addition to your total of 10 cantrips, your spellbook holds two spells of your highest level and four spells of all lower levels. At an even-numbered level, it means you’d have 10 cantrips and four spells of every level.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 136
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Arcane School",
      "Class": "Wizard",
      "Info": {
        "Description": "If you want to be a specialist wizard, choose one school of magic in which to specialize. You gain one additional spell slot for each spell level you can cast, but you may use these spell slots to prepare only spells from your arcane school. You can also prepare one additional cantrip each day, which must be from your specialized school. You gain Spell Points and a special power based on your school (see Arcane Schools on page 137) and add another spell from your chosen school to your spellbook.",
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 136
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Arcane Focus",
      "Class": "Wizard",
      "Info": {
        "Description": "You can place some of your magical power into an item called an arcane focus. Each day when you prepare your spells, you can designate a single item you own as your arcane focus. This is typically an item associated with spellcasting, such as a wand, ring, or staff, but you are free to designate a weapon or other item. You gain the Drain Arcane Focus free action.",
        "References": [],
        "Actions": [
          "Drain Arcane Focus"
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 136
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Expert Spellcaster",
      "Class": "Wizard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for arcane spells increases to expert.",
        "Proficiencies": [
          {
            "Name": "Arcane",
            "Type": "Spells",
            "Value": "Expert"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 137
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Master Spellcaster",
      "Class": "Wizard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for arcane spells increases to master.",
        "Proficiencies": [
          {
            "Name": "Arcane",
            "Type": "Spells",
            "Value": "Master"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 137
          }
        ]
      }
    },
    {
      "Type": "Class Feature",
      "Name": "Legendary Spellcaster",
      "Class": "Wizard",
      "Info": {
        "Description": "Your proficiency rank for spell rolls, spell DCs, and attack rolls for arcane spells increases to legendary.",
        "Proficiencies": [
          {
            "Name": "Arcane",
            "Type": "Spells",
            "Value": "Legendary"
          }
        ],
        "References": [],
        "Actions": [],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 137
          }
        ]
      }
    }
  ],
  "Class Selectables": [
    {
      "Type": "Totem",
      "Name": "Animal Totem",
      "Info": [
        {
          "Description": "The fury of a wild predator fills you when you Rage, granting you uncanny unarmed attacks. Tribes that revere vicious animals (such as apes or bears) give rise to barbarians of this totem. You might also be at war with an uncontrollable, animalistic side of your personality, or you might be a descendant of a werewolf or other lycanthrope. Select an animal from Table 3–3: Animal Totems that best matches your chosen animal totem.",
          "Anathema": "Wielding weapons or flagrantly disrespecting any animal of your totem animal’s kind are anathema to your totem.",
          "Totem Ability": {
            "Name": "Bestial Rage",
            "Description": "When you Rage, you gain your chosen animal’s unarmed attack (or attacks). The specific attack gained, the damage it deals, and its traits are listed on the Animal Totems table. All of these unarmed attacks are in the brawling group. Your Rage action gains the morph, primal, and transmutation traits."
          },
          "Raging Resistance": "The resistance from your raging resistance class feature applies against piercing and slashing damage.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 55
            }
          ]
        }
      ]
    },
    {
      "Type": "Totem",
      "Name": "Dragon Totem",
      "Info": [
        {
          "Description": "You become as wrathful as a mighty dragon and manifest incredible abilities. Perhaps your culture reveres draconic majesty, teaching its warriors techniques that echo draconic fury, or you gained a connection to your totem after drinking or bathing in dragon’s blood or after watching your village burn at the wrath of a marauding wyrm. Select a type of true dragon from Table 3–4: Dragon Totems to be your totem’s chosen dragon. Chromatic dragons tend to be evil and metallic dragons tend to be good.",
          "Anathema": "Defying a dragon of your chosen type or letting a personal insult against you slide is anathema to your totem.",
          "Totem Ability": {
            "Name": "Draconic Rage",
            "Description": "When you are raging, you can make your conditional bonus to damage deal the type of damage of your chosen dragon’s breath weapon, rather than your weapon or unarmed attack’s usual damage type, which increases the damage by 1 (after halving for agile weapons, if applicable). If you do this, your Rage action gains the arcane and evocation traits, as well as the trait matching the damage type."
          },
          "Raging Resistance": "The resistance from your raging resistance class feature applies against piercing damage and the damage type of your chosen dragon’s breath weapon.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 55
            }
          ]
        }
      ]
    },
    {
      "Type": "Totem",
      "Name": "Fury Totem",
      "Info": [
        {
          "Description": "Your rage comes from a deep well within you, rather than from an external source. You use your rage as you choose.",
          "Anathema": "You don’t have an anathema or totem ability. Instead, you gain an additional 1st-level barbarian feat.",
          "Raging Resistance": "The resistance from your raging resistance class feature applies against all physical weapon damage.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 56
            }
          ]
        }
      ]
    },
    {
      "Type": "Totem",
      "Name": "Giant Totem",
      "Info": [
        {
          "Description": "Giants are towering, exceptionally strong humanoids, and some tribes aspire to be like them. Your rage gives you the raw power and size of a giant. This doesn’t mean you revere giants—you might scoff at them, or even aspire to slay them! It could be that you seem to other people like a giant due to your exceptional strength or larger-than-life emotions and ego.",
          "Anathema": "Failing to accept a personal challenge of your strength is anathema to your totem.",
          "Totem Ability": {
            "Name": "Titan Mauler",
            "Description": "You can use a weapon built for a Large creature if you are Small or Medium (both normally and when raging). If you’re not Small or Medium, you can use a weapon built for a creature one size larger than you. You also gain access to your choice of weapon at character creation. When you are wielding such a weapon in combat, double your conditional bonus to damage rolls from raging, but you have the sluggish 1 condition (see page 324) because of the weapon’s unwieldy size. You can’t remove this sluggish condition or ignore its penalties by any means while you’re wielding the weapon."
          },
          "Raging Resistance": "The resistance from your raging resistance class feature applies against bludgeoning damage and your choice of cold, electricity, or fire damage. Choose the damage type when you gain the raging resistance class feature (though you can retrain it later).",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 56
            }
          ]
        }
      ]
    },
    {
      "Type": "Totem",
      "Name": "Spirit Totem",
      "Info": [
        {
          "Description": "Whether you are emotionally sensitive to the activity of spirits around you, belong to a shamanic tribe that worships ancestors or apparitions, or are haunted by a specter of an ancestor, relative, friend, or foe, your rage takes the form of a spiritual possession.",
          "Anathema": "Disrespecting corpses or spirits that are in your presence is anathema to your totem; however, defending yourself against undead creatures is not.",
          "Totem Ability": {
            "Name": "Spirit Rage",
            "Description": "When you are raging, you can make your conditional bonus to damage deal negative or positive damage, rather than your weapon or unarmed attack’s usual damage type (you choose which type each time you Rage). If you choose to do this, your weapon or unarmed attack affects material and incorporeal creatures and objects equally. This makes your weapon overcome incorporeal creatures’ resistance to physical attacks (as the ghost touch property rune). If you choose to deal negative or positive damage, your Rage action gains the divine and necromancy traits, plus the negative or positive trait, as appropriate."
          },
          "Raging Resistance": "The resistance from your raging resistance class feature applies against negative damage, as well as all damage dealt by the attacks and abilities of undead creatures, regardless of the damage type.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 56
            }
          ]
        }
      ]
    },
    {
      "Type": "Totem",
      "Name": "Superstition Totem",
      "Info": [
        {
          "Description": "A deep distrust of magic drives you to forgo the metaphysical nonsense of spellcasters. Whether you’re a member of a superstitious tribe that distrusts magic, a survivor of a magical accident that left your mind and body with an intense aversion to magic, or a scion of a bloodline known for its magic resistance, your rage is inimical to magic. This makes you an excellent mage hunter but slow to trust practitioners of magical arts. Your extremely restrictive anathema grants you powers beyond those of other totems.",
          "Anathema": "Willingly accepting the effects of magic spells (including from scrolls, wands, and the like), even from your allies, is anathema to your totem. You can still drink potions, and you can still invest and activate most magic items you find, though items that cast spells are subject to the same restrictions as all other spells. If an ally insists on using magic on you despite your unwillingness, and you have no reason to believe they will stop, continuing to travel with that ally counts as willingly accepting their spells (as do similar circumstances) and thus is also anathema toyour totem.",
          "Totem Ability": {
            "Name": "Superstition Resistance",
            "Description": "While raging, you gain a +2 conditional bonus to all saves against magic."
          },
          "Raging Resistance": "Choose two associated magical traditions: arcane and occult, arcane and primal, divine and occult, or divine and primal. The resistance from your raging resistance class feature applies against all damage you take from spells of these two traditions of magic, regardless of the type of damage dealt by the spell.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 56
            }
          ]
        }
      ]
    },
    {
      "Type": "Muse",
      "Name": "Lore",
      "Info": [
        {
          "Description": "Your muse drives you to uncover the hidden secrets of the multiverse. You gain the Bardic Lore feat and add true strike to your spell repertoire.",
          "Feat": "Bardic Lore",
          "Spell": "True Strike",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 64
            }
          ]
        }
      ]
    },
    {
      "Type": "Muse",
      "Name": "Maestro",
      "Info": [
        {
          "Description": "Your muse inspires you to ever-greater heights of performance. You gain the Lingering Composition feat and add soothe to your spell repertoire.",
          "Feat": "Lingering Composition",
          "Spell": "Soothe",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 64
            }
          ]
        }
      ]
    },
    {
      "Type": "Muse",
      "Name": "Polymath",
      "Info": [
        {
          "Description": "Your muse flits about to almost every skill and pursuit. You gain the Versatile Performance feat and add summon monster to your spell repertoire.",
          "Feat": "Versatile Performance",
          "Spell": "Summon Monster",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 64
            }
          ]
        }
      ]
    },
    {
      "Type": "Order",
      "Name": "Animal",
      "Info": [
        {
          "Description": "You have a strong connection to the beasts of the world, and you are allied with a beast companion. You are trained in Athletics, and it becomes a signature skill for you. You also gain the Animal Companion druid feat. Finally, as your order power, you can cast heal animal at a cost of 1 Spell Point. ",
          "Anathema": "Committing wanton cruelty to animals or killing animals unnecessarily is anathema to your order. (This doesn’t prevent you from defending yourself against animals or killing them cleanly for food.)",
          "Skill": "Athletics",
          "Feat": "Animal Companion",
          "Power": "Heal Animal",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 80
            }
          ]
        }
      ]
    },
    {
      "Type": "Order",
      "Name": "Leaf",
      "Info": [
        {
          "Description": "You revere plants and the bounty of nature, acting as a gardener and warden for the wilderness, teaching sustainable techniques, and helping areas regrow after disasters or negligent humanoid expansion. You are trained in Diplomacy, and it becomes a signature skill for you. You also gain the Leshy Familiar druid feat. Finally, as your order power, you can cast goodberry at a cost of 1 Spell Point.",
          "Anathema": "Committing wanton cruelty to plants or killing plants unnecessarily is anathema to your order. (This doesn’t prevent you from defending yourself against plants or harvesting them as necessary for survival.)",
          "Skill": "Diplomacy",
          "Feat": "Leshy Familiar",
          "Power": "Goodberry",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 80
            }
          ]
        }
      ]
    },
    {
      "Type": "Order",
      "Name": "Storm",
      "Info": [
        {
          "Description": "You carry nature’s fury within you, channeling it to terrifying effect and riding the winds and storms. You are trained in Acrobatics, and it becomes a signature skill for you. You also gain the Storm Born druid feat. Finally, as your order power, you can cast tempest surge at a cost\nof 1 Spell Point.",
          "Anathema": "Creating unnatural weather patterns that could be damaging to the local environment (such as by using a 9th-level control weather ritual) is anathema to your order.",
          "Skill": "Acrobatics",
          "Feat": "Storm Born",
          "Power": "Tempest Surge",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 80
            }
          ]
        }
      ]
    },
    {
      "Type": "Order",
      "Name": "Wild",
      "Info": [
        {
          "Description": "The savage, uncontrollable call of the natural world infuses you, granting you the ability to change your shape to take on the ferocious form of a wild creature. You are trained in Intimidation, and it becomes a signature skill for you. You also gain the Wild Shape druid feat. Finally, as your order power, you can cast wild claws at a cost of 1 Spell Point.",
          "Anathema": "Becoming fully domesticated by the temptations of civilization is anathema to your order. (This doesn’t prevent you from buying and using processed goods or staying in a city for an adventure, but you can never come to rely on these conveniences or truly call such a place your permanent home.)",
          "Skill": "Intimidation",
          "Feat": "Wild Shape",
          "Power": "Wild Claws",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 81
            }
          ]
        }
      ]
    },
    {
      "Type": "Righteous Ally",
      "Name": "Blade Ally",
      "Info": [
        {
          "Description": "A spirit of valor inhabits your weapon, granting it additional power. Select one weapon each morning when you make your daily preparations. In your hands, the weapon gains your choice of the disrupting, ghost touch, returning, or shifting property (see page 370), without it counting against the weapon’s maximum number of properties. In addition, you gain access to the weapon’s critical specialization effect.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 106
            }
          ]
        }
      ]
    },
    {
      "Type": "Righteous Ally",
      "Name": "Shield Ally",
      "Info": [
        {
          "Description": "A spirit of dedication inhabits your shield, granting it additional benefits. In your hands, the shield increases its Hardness by 2 and gains the ability to take 2 additional Dents before becoming broken. This stacks with any extra Dents the shield can normally take.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 107
            }
          ]
        }
      ]
    },
    {
      "Type": "Righteous Ally",
      "Name": "Steed Ally",
      "Info": [
        {
          "Description": "You gain the service of a trained mount, which is treated as a young animal companion (see page 284). Normally you can select only an animal companion with the mount special ability, such as a horse. At the GM’s discretion, you can select a different type of animal companion appropriate to your ancestry and culture, but it doesn’t gain the mount special ability.",
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 107
            }
          ]
        }
      ]
    },
    {
      "Type": "Bloodline",
      "Name": "Aberrant",
      "Info": [
        {
          "Description": "Something speaks to you from beyond the stars or below the earth. Ancient and unknowable, this alien influence presses against your mind, but grants you power. Whether that power will come with consequences, who can say?",
          "Spell List": "Occult",
          "Skills": [
            "Acrobatics",
            "Intimidation",
            "Occultism",
            "Stealth"
          ],
          "Spells": {
            "Cantrip": [
              "Daze"
            ],
            "1st": [
              "Phantom Pain"
            ],
            "2nd": [
              "Enlarge"
            ],
            "3rd": [
              "Mind Reading"
            ],
            "4th": [
              "Confusion"
            ],
            "5th": [
              "Black Tentacles"
            ],
            "6th": [
              "Feeblemind"
            ],
            "7th": [
              "Warp Mind"
            ],
            "8th": [
              "Mind Blank"
            ],
            "9th": [
              "Shapechange"
            ]
          },
          "Powers": {
            "Initial": [
              {
                "Power": "Tentacular Limbs",
                "Cost": 1
              }
            ],
            "Advanced": [
              {
                "Power": "Aberrant Whispers",
                "Cost": 2
              }
            ],
            "Greater": [
              {
                "Power": "Unusual Anatomy",
                "Cost": 2
              }
            ]
          },
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 130
            }
          ]
        }
      ]
    }
  ],
  "Deities": [
    {
      "Type": "Deity",
      "Name": "Abadar",
      "Info": {
        "Edicts": "bring civilization to the frontiers, earn wealth through hard work and trade, follow the rule of law",
        "Anathema": "engage in banditry or piracy, steal, undermine a law-abiding court",
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 288
          }
        ]
      }
    }
  ],
  "Feats": [
    {
      "Type": "Feat",
      "Name": "Ancestral Hatred",
      "Traits": [
        "Dwarf"
      ],
      "Level": 1,
      "Info": [
        {
          "Description": "You have shaped your hatred of ancestral dwarven foes into a powerful weapon. Choose two of the following creature traits: derro, duergar, giant, or orc. You gain a +1 circumstance bonus to damage rolls against creatures with one of the chosen traits. If a creature with a chosen trait critically succeeds at an attack against you, this bonus increases to +4 against that creature for 1 minute.",
          "Special": "Your GM can add appropriate creature traits to this list if your character is from a community that commonly fights other types of enemies.",
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 25
            }
          ]
        }
      ]
    },
    {
      "Type": "Feat",
      "Name": "Ancestral Hatred",
      "Traits": [
        "Dwarf"
      ],
      "Level": 1,
      "Info": [
        {
          "Description": "You have shaped your hatred of ancestral dwarven foes into a powerful weapon. Choose two of the following creature traits: derro, duergar, giant, or orc. You gain a +1 circumstance bonus to damage rolls against creatures with one of the chosen traits. If a creature with a chosen trait critically succeeds at an attack against you, this bonus increases to +4 against that creature for 1 minute.",
          "Special": "Your GM can add appropriate creature traits to this list if your character is from a community that commonly fights other types of enemies.",
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 25
            }
          ]
        }
      ]
    },
    {
      "Type": "Feat",
      "Name": "Gray Maiden Dedication",
      "Traits": [
        "Archetype",
        "Dedication",
        "Prestige"
      ],
      "Level": 6,
      "Rarity": "Rare",
      "Info": [
        {
          "Prerequisites": [
            {
              "Req": "Stat",
              "Name": "Strength",
              "Value": 16
            },
            {
              "Req": "Save",
              "Name": "Fortitude",
              "Value": "Expert"
            },
            {
              "Req": "Armor",
              "Name": "Heavy Armor",
              "Value": "Trained"
            },
            {
              "Req": "Weapon",
              "Name": "Martial Weapons",
              "Value": "Trained"
            },
            {
              "Req": "Member",
              "Name": "Gray Maidens"
            }
          ],
          "Description": "Your Gray Maiden training has steeled you against harsh physical conditions. You become a master at Fortitude saves. When you succeed at a Fortitude save, treat it as a critical success. You also gain access to special armor: Gray Maiden plate. Gray Maiden plate is a level 3 item that costs 600 sp, grants +7 AC and +3 TAC, and has a Dexterity modifier cap of +0; otherwise, it uses the same stats as full plate.",
          "Special": "You cannot select another dedication feat until you have gained two other feats from the Gray Maiden archetype.",
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 281
            }
          ]
        }
      ]
    },
    {
      "Type": "Feat",
      "Name": "Dueling Riposte",
      "Action": "R",
      "Traits": [
        "Fighter"
      ],
      "Level": 8,
      "Info": [
        {
          "Prerequisites": [
            {
              "Req": "Feat",
              "Name": "Dueling Parry"
            }
          ],
          "Requirements": "You are benefiting from Dueling Parry.",
          "Trigger": "An opponent within your reach critically fails a Strike against you.",
          "Description": "You riposte against your flailing enemy. Make a melee Strike or Disarm action against the triggering opponent.",
          "Reference": [],
          "Source": [
            {
              "Source": "Pathfinder Playtest Rulebook",
              "Page": 92
            }
          ]
        }
      ]
    },
    {
      "Type": "Feat",
      "Name": "Aggressive Shield",
      "Action": "F",
      "Traits": [
        "Fighter"
      ],
      "Level": 2,
      "Info": {
        "Trigger": "You use a Shield Block reaction with a heavy shield, and the opponent who triggered that reaction is adjacent to you and your size or smaller.",
        "Description": "You push the triggering creature, either automatically Shoving it 5 feet or causing it to become %0 until the start of your next turn. The triggering creature chooses whether to be moved or %0. If it chooses to be moved, you choose the direction. If that would cause it to hit a solid object or enter a square of difficult terrain, it must become %0 instead of being moved. You can’t Shove it into another creature’s space.",
        "Reference": [
          {
            "Text": "flat-footed",
            "Name": "Flat-footed",
            "Type": "Condition"
          }
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 90
          }
        ]
      }
    },
    {
      "Type": "Feat",
      "Name": "Intimidating Strike",
      "Action": "2",
      "Traits": [
        "Attack",
        "Fear",
        "Fighter",
        "Emotion",
        "Mental"
      ],
      "Level": 2,
      "Info": {
        "Description": "Your strike not only wounds creatures, but also shatters their confidence. Make a melee %0. It gains the following %1.",
        "Subsections": {
          "Enhancement": "The target is %2 and becomes %3 until the end of your turn."
        },
        "Reference": [
          {
            "Text": "Strike",
            "Name": "Strike",
            "Type": "Basic Action (pg 307)"
          },
          {
            "Text": "enhancement",
            "Name": "Enhancements",
            "Type": "Rule"
          },
          {
            "Text": "frightened",
            "Name": "Frightened",
            "Type": "Condition"
          },
          {
            "Text": "flat-footed",
            "Name": "Flat-footed",
            "Type": "Condition"
          }
        ],
        "Source": [
          {
            "Source": "Pathfinder Playtest Rulebook",
            "Page": 90
          }
        ]
      }
    }
  ],
  "Items": [],
  "Actions": [
    {
      "Type": "Action",
      "Name": "Quick Alchemy",
      "Action": 1,
      "Traits": [
        "Alchemist"
      ],
      "Cost": [
        {
          "Type": "Resonance",
          "Amount": 1
        }
      ],
      "Requirements": "You must have alchemist’s tools (see page 184), the formula of the alchemical item you’re creating, and a free hand.",
      "Description": "You create a single common alchemical item that is of your level or lower without having to spend the normal monetary cost in alchemical reagents or needing to attempt a Crafting check. This item has the infused trait, but it remains potent only until the start of your next turn. After this period, the item becomes inert and grants no effects. If you overspend Resonance Points to use this ability and fail the flat check (see page 292), you can’t use the Quick Alchemy action again until the next time you undertake your daily preparations.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 46
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Rage",
      "Action": 1,
      "Traits": [
        "Barbarian",
        "Concentrate",
        "Emotion",
        "Mental"
      ],
      "Cost": [],
      "Requirements": "You can’t be fatigued, raging, or wearing heavy armor.",
      "Description": "You begin raging. You gain a number of temporary Hit Points equal to your level plus your Constitution modifier and enter a state of pure rage that lasts for 3 rounds. While you are raging, you are affected in these ways:\n• Gain a +2 conditional bonus to damage rolls with melee weapons and unarmed Strikes. The bonus is halved if your weapon or unarmed Strike is agile. This bonus increases by 1 at level 3 and every 4 levels thereafter.\n• Take a –1 penalty to AC.\n• You can’t use actions that have the concentrate trait unless they also have the rage trait. The Seek basic action gains the rage trait while you’re raging.\n  After you have stopped raging, you lose any remaining temporary Hit Points from using the Rage action, you can’t use Rage again for 1 round, and you are fatigued for 1 round. You can’t voluntarily stop raging. If you stop raging before its usual duration expires, you are fatigued and can’t Rage again until after the end of your next turn.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 53
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Mighty Rage",
      "Action": "F",
      "Traits": [
        "Barbarian"
      ],
      "Cost": [],
      "Trigger": "You use the Rage action.",
      "Description": "Use one of your actions that has the rage trait.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 54
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Attack of Opportunity",
      "Action": "R",
      "Traits": [
        "Fighter"
      ],
      "Cost": [],
      "Trigger": "A creature within your reach uses a manipulate action or a move action, makes a ranged attack, or leaves a square during a move action it’s using.",
      "Description": "Make a melee Strike against the triggering creature at a –2 penalty. If the attack hits and the trigger was a manipulate action, you disrupt that action. This Strike doesn’t count toward your multiple attack penalty, and your multiple attack penalty doesn’t apply to it.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 87
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Flurry of Blows",
      "Action": 1,
      "Traits": [
        "Fighter"
      ],
      "Cost": [],
      "Frequency": "Once per round.",
      "Description": "Make two unarmed Strikes. If both hit the same creature, combine their damage and enhancements for the purpose of resistances and weaknesses.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 97
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Retributive Strike",
      "Action": "R",
      "Traits": [
        "Paladin"
      ],
      "Cost": [],
      "Trigger": "A creature within your reach hits an ally or friendly creature.",
      "Description": "Make a melee Strike against the triggering creature at a –2 penalty before the opponent rolls the damage for the triggering hit. If your attack hits, the target is enfeebled 1 for the remainder of its turn, or enfeebled 2 for the remainder of its turn if your Strike was a critical hit. The enfeebled condition ends immediately if the creature makes a Strike against you. If Retributive Strike incapacitates or kills the triggering creature, the triggering hit deals no damage.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 106
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Retributive Strike",
      "Action": 1,
      "Traits": [
        "Ranger"
      ],
      "Cost": [],
      "Requirements": "You can see or hear the target.",
      "Description": "You designate a single creature within 100 feet as your target and focus your attacks against that creature. While hunting that creature, you gain benefits for focusing your attacks. As long as all your attacks in a round are against target you’re hunting, the multiple attack penalty you take on the second attack is –4 (–3 with an agile weapon) instead of –5, and –8 (–6 with an agile weapon) instead of –10 on the third and any further attacks in the round. You also ignore the penalty for making ranged attacks against the target you’re hunting within your second range increment. You also gain a +2 circumstance bonus to Perception checks when you Seek your target and a +2 circumstance bonus to Survival checks when you Track your target.\n  You can have only one creature designated as the target of your hunt at a time. If you use Hunt Target against a creature when you already have a creature designated, the prior creature loses the designation and the new target gains the designation. In any case, this designation lasts until your next daily preparation (see page 332).",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 113
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Debilitating Strike",
      "Action": "F",
      "Traits": [
        "Rogue"
      ],
      "Cost": [],
      "Trigger": "Your Strike hits a flat-footed creature.",
      "Description": "You apply one of the following debilitations, which lasts until the end of your next turn.",
      "Subsections": {
        "Debilitation": [
          "The target becomes entangled.",
          "The target becomes enfeebled 1."
        ]
      },
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 120
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Master Strike",
      "Action": "F",
      "Traits": [
        "Rogue"
      ],
      "Cost": [],
      "Trigger": "Your Strike hits a flat-footed creature.",
      "Description": "You apply the following enhancement.",
      "Subsections": {
        "Enhancement": "The target must attempt a Fortitude save at your class DC, with the following effects. It is bolstered.",
        "Success": "The target is enfeebled 2 until the end of your next turn.",
        "Critical Success": "No effect.",
        "Failure": "The target is paralyzed for 4 rounds.",
        "Critical Failure": "The target is paralyzed for 4 rounds, knocked unconscious for 2 hours, or killed (your choice)."
      },
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 120
        }
      ]
    },
    {
      "Type": "Action",
      "Name": "Drain Arcane Focus",
      "Action": "F",
      "Traits": [
        "Arcane",
        "Wizard"
      ],
      "Cost": [],
      "Frequency": "once per day",
      "Trigger": "Your turn begins.",
      "Description": "You expend the magical power stored in your arcane focus. This gives you the ability to cast one spell you prepared today and previously cast, without spending a spell slot. You must still complete the required spellcasting actions and meet the spell’s other requirements.",
      "Source": [
        {
          "Source": "Pathfinder Playtest Rulebook",
          "Page": 136
        }
      ]
    }
  ],
  "Spells": [],
  "Spell lists": [],
  "Hazards": [],
  "Rules": []
}
